{"meta":{"title":"Nikola的博客","subtitle":"用舍由时，行藏在我","description":"用舍由时，行藏在我","author":"Nikola","url":"http://hi-nikola.cn","root":"/"},"pages":[{"title":"about","date":"2023-12-08T08:26:13.831Z","updated":"2023-12-08T08:26:13.831Z","comments":true,"path":"about/index.html","permalink":"http://hi-nikola.cn/about/index.html","excerpt":"","text":"我，一个湖北人。 目前从事数据开发工作（希望有同行交流经验）。 目前，文章更新在blog和newsletter： 欢迎订阅我的newsletter：https://nikola.zhubai.love 博客订阅可参考：RSS订阅工具 - 博客志 (jetli.com.cn) 为什么做个人博客？有四点原因：一、随着年龄的增长，我越来越发现“输出”的重要性，我想通过博客的记录来整理自己的思绪，把自己一些零碎的想法进行加工，能够完整呈现出来。二、对各种媒体的内容太失望了。（抖音、头条、知乎、微博、豆瓣、贴吧等）企图制造各种流量话题（本人对实时热点也并不追捧），且这些内容质量不高， 因此不如把时间花在自我思考、阅读以及产出内容上。三、近段时间我在互联网上看到的比较有深度的文章基本都是通过个人博客，有的文章看完后可以沉思很久，仿佛和博主进行了深度的对话，我相信博客连接着这个网络世界里相似的人，我也希望通过博客能够认识更多有趣的人！四、互联网是开放而非封闭，我希望我的博客可以带给他人一些用处。 我的联系方式邮箱：&#104;&#x69;&#x2d;&#x6e;&#x69;&#x6b;&#x6f;&#108;&#x61;&#64;&#x61;&#108;&#105;&#121;&#x75;&#x6e;&#x2e;&#99;&#x6f;&#x6d; 目前，已关闭评论功能，可邮箱联系交流。"},{"title":"categories","date":"2023-12-08T08:26:13.833Z","updated":"2023-12-08T08:26:13.833Z","comments":true,"path":"categories/index.html","permalink":"http://hi-nikola.cn/categories/index.html","excerpt":"","text":""},{"title":"index","date":"2023-11-11T02:54:59.000Z","updated":"2023-12-08T08:26:13.835Z","comments":true,"path":"index/index.html","permalink":"http://hi-nikola.cn/index/index.html","excerpt":"","text":"Hi I’m Nikola 👨‍💻Welcome to my blog!🌻 🧱I’m a data engineer and I engage in data analysis and data governance . 📖I’m currently learning ML. ❤️I think English and programming are the most useful and interesting tools I have leaned . 😀an ordinary life is also worth recording😀 陌生人，祝你快乐："},{"title":"list","date":"2023-11-11T02:59:39.000Z","updated":"2023-12-08T08:26:13.835Z","comments":true,"path":"list/index.html","permalink":"http://hi-nikola.cn/list/index.html","excerpt":"","text":""},{"title":"","date":"2023-12-08T08:26:13.835Z","updated":"2023-12-08T08:26:13.835Z","comments":true,"path":"tags/index.html","permalink":"http://hi-nikola.cn/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Feeling the Meaninglessness of Work","slug":"Feeling the Meaninglessness of Work","date":"2023-12-02T16:09:06.000Z","updated":"2023-12-22T09:41:00.470Z","comments":true,"path":"2023/12/03/Feeling the Meaninglessness of Work/","link":"","permalink":"http://hi-nikola.cn/2023/12/03/Feeling%20the%20Meaninglessness%20of%20Work/","excerpt":"I suddenly feel disheartened 😟 and believe that my work is meaningless.","text":"I suddenly feel disheartened 😟 and believe that my work is meaningless. On one hand, the work itself lacks meaning, as I fail to see the value it brings. It feels like whether I do well or not on this project doesn’t make much difference, and my impact within this project is minimal. I envy farmers in the countryside who can produce food and sustain humanity. Without me, without this project, it seems like the world could possibly be better, and the people I interact with might have an easier time. My colleagues tell me, “I know this project is shit, you know it, and our leaders know it too, but we still put in so much effort to make this shit look exquisite. It’s really not easy for everyone.” On the other hand, I feel discouraged about myself. Suddenly, I realize that I have been confined to a specific field for too long, and my influence on the entire business, even the whole project, is too limited. I want to have more exposure to the business and management aspects, to understand the entire process from project initiation to implementation. Lastly, I’m disheartened by the nature of work itself. I suddenly realize that work seems to be a shackle imposed on humanity, especially in our country with its distorted competition and pressure. It truly feels like we are always working, occasionally pausing to live. In such an environment, I am merely fuel for society. Throughout the year, I am far away from home, working all the time. Even on weekends, I cannot gather with family and friends; instead, I find myself alone at home, looking at code and learning. It seems like this kind of life has no end, monotonous and tasteless. Today, I saw a lengthy post on my friend’s social media. The essence of it was that her husband has been constantly traveling abroad for work since they got married. They rarely have time to be together as a family, and she handles all the responsibilities at home, big and small, by herself. She feels exhausted and even mentioned that if given the chance, she wouldn’t choose to get married. Thinking back to this year’s Lunar New Year, the New Year’s Eve was not a statutory holiday. We had a mere seven days off, with two days spent on traveling. It felt disheartening. I remember when I was young, the Lunar New Year used to be long and exciting. It started from the eighth day of the twelfth lunar month, and I eagerly anticipated it. We would start buying preserved food on the twenty-third day of the twelfth lunar month, making sausages, and it was only on the fifteenth day of the first lunar month that I would start school. In my memory, even adults didn’t go back to work until the eighth day of the first lunar month. The development of industrialized economy doesn’t seem to make people happier.","categories":[{"name":"English","slug":"English","permalink":"http://hi-nikola.cn/categories/English/"}],"tags":[{"name":"思考","slug":"思考","permalink":"http://hi-nikola.cn/tags/%E6%80%9D%E8%80%83/"}]},{"title":"How to Learn English Well","slug":"How-to-Learn-English-Well","date":"2023-10-14T15:04:14.000Z","updated":"2023-12-08T08:26:13.685Z","comments":true,"path":"2023/10/14/How-to-Learn-English-Well/","link":"","permalink":"http://hi-nikola.cn/2023/10/14/How-to-Learn-English-Well/","excerpt":"From now on, I will embark on English practice. First, I will draft blogs in English on my own and then refine them using ChatGPT. Each blog will revolve around a specific topic where I share my viewpoints.","text":"From now on, I will embark on English practice. First, I will draft blogs in English on my own and then refine them using ChatGPT. Each blog will revolve around a specific topic where I share my viewpoints. Today’s topic centers on strategies for effective English learning and my upcoming plans. What I’ve Done So FarI’ve managed to memorize approximately 4,000 IELTS words. However, my challenge lies in employing them effectively in dialogues and sentences. Thus, I recognize the need to familiarize myself with their practical applications. My Future Steps Read More: The adage “the more you read, the more you know” holds true. Reading extensively not only enriches my vocabulary but also demonstrates the ways in which words can be used. Watch More: I’ll invest time in viewing English vlogs, paying keen attention to both pronunciation and grammatical structures. Practice More: Emphasizing active usage, I plan to write frequently and converse with friends in English.","categories":[],"tags":[{"name":"English","slug":"English","permalink":"http://hi-nikola.cn/tags/English/"}]},{"title":"放假前夕失眠以及一些emo","slug":"放假前夕失眠以及关于人生的emo","date":"2023-09-27T19:01:25.000Z","updated":"2023-12-08T08:26:13.789Z","comments":true,"path":"2023/09/28/放假前夕失眠以及关于人生的emo/","link":"","permalink":"http://hi-nikola.cn/2023/09/28/%E6%94%BE%E5%81%87%E5%89%8D%E5%A4%95%E5%A4%B1%E7%9C%A0%E4%BB%A5%E5%8F%8A%E5%85%B3%E4%BA%8E%E4%BA%BA%E7%94%9F%E7%9A%84emo/","excerpt":"明天今天早上八点多的火车，结果现在还没睡着（3：03）——玩了一局文明6已经是凌晨1点，躺在床上感觉浑身痒痒，用硫磺皂洗了个澡，稍微好点，但是依然难受，刷了刷朋友圈，开始emo，更是睡不着，于是干脆爬起来写写博客。","text":"明天今天早上八点多的火车，结果现在还没睡着（3：03）——玩了一局文明6已经是凌晨1点，躺在床上感觉浑身痒痒，用硫磺皂洗了个澡，稍微好点，但是依然难受，刷了刷朋友圈，开始emo，更是睡不着，于是干脆爬起来写写博客。 于是记录下自己emo的所思所想。 人生的幸福是基于健康的。精神的痛苦和肉体的痛苦，哪个更难忍受？都挺痛苦的，但是我觉得，肉体的痛苦会更影响精神，精神是基于肉体的，肉体的健康与否会影响精神，如果你让一个胳膊残疾的人忽略自身的缺陷，保持积极向上的态度，我觉得是残忍的。但是如果一个人精神颓靡抑郁，却可以通过饮食、运动来让其振奋精神。每当我听到有人说喜欢史铁生的文字的时候我都会觉得伤感，如果换做我是史铁生，我肯定不愿意用双腿残废来换取深刻的思想和文字。我常代入他的角色，我觉得他是求死之人，一心渴望结束生命，但是却又求而不得，因为死并不比生容易，选择去死意味着对抗自己求生的动物本能，那么既然活了下来总得干点什么，好吧，那就写写书吧，记录下自己求死与求生的心理过程。所以，史铁生是无奈的、没有选择的活着的而写作成了他打发生命的工具（我是这样代入臆想的）。 与他人比较是痛苦的。早已关闭了朋友圈，但是今天闲着刷了一下，发现刷朋友圈是个错误的决定——在这个过程中我总是在产生焦虑，也就是会有peer pressure。看到有人秀自己的孩子了，我会产生结婚焦虑；看到有人旅游了，我会产生时间焦虑；看到有人买车买房了，我会产生财富焦虑。诚然，现在自己过得一般，虽能够“定乎内外之分”，但是难免焦虑。有的人在大厂奋斗，羡慕其收入丰厚，有的人老家上岸，羡慕其生活悠闲。不管哪种生活，仿佛在刷朋友圈的那一瞬间就只看到、想到其好的一面，焦虑的情绪立马起来。但是放下手机仔细想想冷静一下，好像也没有那么羡慕，况且别人的再好也是别人的，自己的再差也是自己的🌝。 想到云柚的处境。有一次，云柚说：“我从毕业以来一直在考试，整个人都快麻木了，我看到别人的人生都已经进入了一个新的阶段，而我还在原地打转。别人的人生过得越来越好，而我好像过得越来越差”。听到这些我忍不住的心疼，一方面大的环境的确如此，就业环境艰难，另一方面她好像被考试、父母束缚被迫做自己不喜欢的事情，原本有灵气的小姑娘被折腾的憔悴。我想，这种处境她最多再熬这半年，后面我是不愿意她再去考试，如果真考不上，也得先换个环境或者边上班边考试。哎，考试真是让人头大，想想都觉得压力，更别说如今白热化的考公了。 就emo到这里吧。一切都会过去，好的坏的。","categories":[],"tags":[{"name":"生活","slug":"生活","permalink":"http://hi-nikola.cn/tags/%E7%94%9F%E6%B4%BB/"}]},{"title":"强迫症与人生的松弛感","slug":"强迫症与人生的松弛感","date":"2023-07-30T03:58:33.000Z","updated":"2023-12-08T08:26:13.705Z","comments":true,"path":"2023/07/30/强迫症与人生的松弛感/","link":"","permalink":"http://hi-nikola.cn/2023/07/30/%E5%BC%BA%E8%BF%AB%E7%97%87%E4%B8%8E%E4%BA%BA%E7%94%9F%E7%9A%84%E6%9D%BE%E5%BC%9B%E6%84%9F/","excerpt":"这个话题一直想聊。在我那段痛苦的时间里，我曾一度告诉自己：等走出了这个心理怪圈，我一定要写一篇文章讲讲这段故事，帮助那些还在痛苦中的伙伴。现在想想，写这篇文章更多的是给自己一个交代，给这段独特的心理体验做一个总结，在这个过程中更多的是对人生的思考，对“人应该怎样和自己相处”的反思。今天就来聊一聊我在“强迫症”中的一些故事。","text":"这个话题一直想聊。在我那段痛苦的时间里，我曾一度告诉自己：等走出了这个心理怪圈，我一定要写一篇文章讲讲这段故事，帮助那些还在痛苦中的伙伴。现在想想，写这篇文章更多的是给自己一个交代，给这段独特的心理体验做一个总结，在这个过程中更多的是对人生的思考，对“人应该怎样和自己相处”的反思。今天就来聊一聊我在“强迫症”中的一些故事。 什么时候意识到“强迫”思维|行为的？“强迫症”真正困扰我是在我高二的时候，那个时候学习压力大，成绩一直提不起来，内心极度压抑，每天都沉浸在自我的世界里“自我PUA”、自我打鸡血。现在想想觉得好笑，可是当时那个年纪，在那种学习氛围里面，没有真正的朋友，由于个人思维的局限陷入“唯分数论”的应试教育怪圈——我算是被应试教育狠狠毒打一顿的人。在那个时候我开始产生一些强迫性的行为，比如不停地把笔摆成水平、忍不住把自己衣服磨平不允许衣服褶皱、内心不停地数数字、极其不能忍受别人抖腿等等，并且内心伴随着极其严重的焦虑（强迫症也是焦虑症的一种，没准潜意识希望通过一种重复性的行为来缓解焦虑，结果也带来了新的焦虑），于是当我努力克制自己不要注意到这些的时候发现没办法控制自己，于是强迫产生了。 与其说“强迫”是某个时间节点产生，不如说在他一直都在。 为什么这么说呢？其实每个人或多或少都有“强迫”思维或者行为，比如重复检查自己钱包、重复检查门是否上锁，这些都是很正常的重复行为，这个过程中没有焦虑和克制重复行为的心理产生，所以一般人不会感受到痛苦。那为什么有的人就会痛苦呢？当某个时间节点，潘多拉魔盒被打开——可能是自身压力比较大、可能是内心产生了极强的冲突，于是这种痛苦就产生了。 强迫是正常的！每个人都有重复性的一些行为，或者说人的本能里面本身就有，有的深陷“强迫症”中的朋友想完全摆脱这种痛苦，你这是在和人性挑战啊，这怎么可能成功呢？唯一的办法是“接纳”，这个接纳是主动地接纳不是被动的接纳，也有朋友会说“我都这么痛苦了，你还让我接纳，我怎么接纳，接纳了可我还是痛苦，怎么办？！”其实，在“强迫症”的治疗里，有一句很出名的话——“顺其自然，为所当为”，何为顺其自然？何为为所当为？就是既然“强迫症”是正常的，那你想去做就去做，没有必要有那么激烈的克制和内心冲突。 其实，每个人都有“强迫症”的潜质，还记得那个著名的“白熊效应”实验吗？为什么越想停止胡思乱想，就越是停不下来？——当我们被要求不要去想或做一件事时，我们的注意力已经成功地“扎根”到这件被告知“不要想或做”的事情上了 ，从而使我们无法从根本上放弃对事情的关注。这不就是强迫症吗？所以，真正的解决办法是放下内心的冲突，不要去克制，忍不住了就去做，该干嘛就干嘛，自然就好了。 怎么解决“强迫症”？道理这么简单，可并不容易那么摆脱。其实这本身就是一个长期的过程，这个过程是学会如何和自己相处，学会如何处理自己的情绪，深刻认识到自己思维的一个过程，更重要的是这个不是你意识到问题怎么解决就能解决，而是你能够去做到才行，这件事不是理智的、逻辑性的，而是感性的、需要靠自己感受的， 也就是用自己的心去感受而不是脑子去想。情绪问题本身是没办法用逻辑去解决的，并不是你意识到你就能解决。就比如你养了一直可爱的小猫，可惜不幸病死，你会很伤心，你的理智告诉你不要伤心，可是这根本不起作用，你还是会忍不住难过，因此，你要找到那种平衡自己内心的方式和状态。 找到人生的松弛感我一直觉得中国的学生很累，而且是被迫着累，没办法逃避这种环境，吃了苦学习还没效果。如果让我重来，我会快乐的体验高中，而不是被单一的评价体系束缚，现在想想，在学校成绩不好顶多被老师pua，这算多大的事呢？脸皮厚一点就行了，等长大了后面一大堆的事情，哪一样不比考试难得多？因此，学会放松，找到人生的乐趣，必须学会掌控自己的人生——起码自己的心情不要被外界的评价给捆绑。 最后其实，那几年痛苦的感受好像千言万语，现在写来也就三言两语，欲说还休，欲说还休，却道天凉好个秋。 如果有“强迫症”的朋友看到这篇文章，我希望你能够放轻松一点，用感受而不是用脑子去解决这种情绪问题。并且，我希望你能够找到人生的那种松弛感，与其说是在思考如何解决强迫症，不如说是在思考人应该怎样享受他的一生。","categories":[],"tags":[{"name":"思考","slug":"思考","permalink":"http://hi-nikola.cn/tags/%E6%80%9D%E8%80%83/"}]},{"title":"我在北京租房这件事的反思","slug":"我在北京租房这件事的反思","date":"2023-07-01T08:23:33.000Z","updated":"2023-12-08T08:26:13.720Z","comments":true,"path":"2023/07/01/我在北京租房这件事的反思/","link":"","permalink":"http://hi-nikola.cn/2023/07/01/%E6%88%91%E5%9C%A8%E5%8C%97%E4%BA%AC%E7%A7%9F%E6%88%BF%E8%BF%99%E4%BB%B6%E4%BA%8B%E7%9A%84%E5%8F%8D%E6%80%9D/","excerpt":"来北京已经三个多月了，之前一直住的宾馆，前几天公司让我租房，节省开支，其实我在宾馆住了这几个月也非常的不爽，我总觉得宾馆的床不干净、太小了。于是开始找房，结果出现了各种问题，昨天晚上一晚上没睡好就在自我反思——其实我本应该做出更好的决策。","text":"来北京已经三个多月了，之前一直住的宾馆，前几天公司让我租房，节省开支，其实我在宾馆住了这几个月也非常的不爽，我总觉得宾馆的床不干净、太小了。于是开始找房，结果出现了各种问题，昨天晚上一晚上没睡好就在自我反思——其实我本应该做出更好的决策。 自如 or 中介我在和平门上班，预算是4500以内，公司报销，中介带我看了马家堡的房子，6、7个房子但是都不怎么满意，主要是感觉中介的房子都挺脏乱的，并且价格并不比自如便宜多少，还要押一付三以及一个月的中介费，也就是说我要一次性拿出5个月的房租给中介将近20000块钱，我觉得太多。选择自如可以月付，相对比较正规，能按照合同开发票，自如管家素质相对较高，能省事很多。我于是选择了自如，在这个选择上我的决定是正确的。 自如公寓 or 合租4500以内的预算在北京肯定不可能特别好的单间，而且我对单间需求不高，那么就有自如寓和合租。自如公寓我看了就是一间挨着一间都是隔板房，空间小不隔音，于是选择合租独卫。在这个选择上我的决定是正确的。 地理位置选择从这里我开始做错误的决策。对于地理位置的选择，其实我的选择都可以，东南西北哪里都能去，但是我听说同事都在马家堡、新宫、西红门住，于是自然而然就开始往这方向找，最终在西红门找到了房子。但是现在来看，从西红门到和平门通勤都快一个小时了，对于我来说其实应该优先选择其他更近一点的位置，但是当时我看自如没有马家堡、角门西比较合适的房子于是就来到西红门看房子。其实，我也可以去东西北其他方位找找房子，并不一定非要往南找和同事住得近的地方，这个决策有点小小的错误，但是影响不大，因为我能接受1小时的通勤。 房子的选择在西红门有多间独卫房子，当时选择了最大的一件40平，但是很快我就发现了问题：一、空间大没啥用，空调凉快的慢 二、距离地铁站远，将近两公里了 三、靠近马路噪音大。在发现这些问题后我也看了其他房子，但是觉得在搬家有点麻烦，并且没有问清楚自如的换租政策，我一直在犹豫换不换租，最后取消了换租申请，结果！！！！当天晚上一晚上没睡着，因为房间靠近马路，声音实在太大。以前我一直以为自己睡眠很深，不会受外界噪音影响，但是这两天被来回的车辆声音搞得快神经衰弱了，于是决定换房，但是自如告诉我前三天免费换租，第四天没办法免费换租了，想换租得扣一半的房租！！！！我的天，我在第三天的时候手贱取消了换租，因为这个决定我会多花将近2000块钱。这也太不划算的，于是开始深深自责懊恼，为什么这么快就取消了换租。于是网上看各种攻略，看看能不能有其他解决办法。最终我看咸鱼有个企悦会的认证，只需要400块就能换租，行吧，从损失2000到损失400一下子好像也不是不能接受了。但是，因为我点击了取消换租按钮，我就得花400块来弥补我的决策失误。其实，我在取消换租前应该和自如管家确定清楚，而不是怕麻烦怕打扰人家，问清楚规定之后，这400块冤枉钱可能就不用花了。 总结从租房这件事情的反思我得到以下一些道理： 不要怕麻烦自如管家。因为带我看房的是一个刚毕业的女自如管家，晚上八九点带我看了五六间房，我当时觉得不停地问她问题、不在她那订房有点心怀内疚，但是现在想来这个就是她的工作，无论是带我看房还是回复我的问题都是她的工作，我没必要给一些“假惺惺”的同情，结果还导致我住进一个不好的房子。事实上，这种销售性质的工作并不存在什么感情可言，管家在和我签约后，在我遇到问题时明显变得冷漠回复速度很慢，不过这都是可以想得通的：他们的任务是挣钱，签约后钱就挣到了，后续的一些乱七八糟的事情并不能给他们带来收入更何况他们也要迎接新的客户挣更多的钱。 一定要多问、问清楚。在中介那就是这样，很多规定（坑）你不问他就不会说，所以一定要提前了解，多问、问清楚。 做决定时，一定要梳理清楚逻辑。我的问题是很多决定容易靠感觉来判断，而不是逻辑支撑，这就造成有些我不清楚的事情上感觉判断错误。所以在做决定时我要梳理清楚123条原因，明确自己的问题后再去判断，并且在犹豫的时候不要轻易做决定，给出自己思考的“缓冲”时间。","categories":[],"tags":[{"name":"生活","slug":"生活","permalink":"http://hi-nikola.cn/tags/%E7%94%9F%E6%B4%BB/"}]},{"title":"看了一位UP的视频，我也想聊一聊摄影的目的","slug":"摄影的目的","date":"2023-06-11T03:09:53.000Z","updated":"2023-12-08T08:26:13.724Z","comments":true,"path":"2023/06/11/摄影的目的/","link":"","permalink":"http://hi-nikola.cn/2023/06/11/%E6%91%84%E5%BD%B1%E7%9A%84%E7%9B%AE%E7%9A%84/","excerpt":"看了B站一位UP主—小明关于摄影目的vlog（链接：关于摄影的真诚问题_哔哩哔哩_bilibili），深有感触，想在这里聊一下我的看法。","text":"看了B站一位UP主—小明关于摄影目的vlog（链接：关于摄影的真诚问题_哔哩哔哩_bilibili），深有感触，想在这里聊一下我的看法。 小明提到的这些经历我都体验过：从摄影小白慢慢学习摄影技术，了解了一些艺术史知道了很多摄影艺术家的名字，到开始模仿大师风格，模仿他们的构图和色彩等，然后又追求特别“当代的照片”，让自己的照片故弄玄虚，甚至自己都看不懂，以至于自己忘掉了拍照的目的，其间也约女孩子拍过照片，也被当过工具人。 摄影的目的对于大多数人，玩摄影如果不是为了赚钱、成为艺术家，那么学会基本的摄影技巧、了解常用的操作就够用了。现在的相机越来越智能，完全傻瓜式的操作再加上手机app傻瓜式的修图软件，已经能够满足绝大部分人的需求了。 当然，我们可以去学习了解其他的摄影师是怎么拍的，然后努力让自己的照片变得更好，这些都没有问题，但是往往在这个过程中很多人会陷入一种怪圈：极力的去模仿大师的作品、产生摄影鄙视链——风格A的鄙视风格B、忘记了自己拍照的目的完全沉浸在所谓的风格和技术的怪圈里。 比如，很多人了解了某个当代摄影艺术家后，就觉得他的摄影风格很高级，其他的都是垃圾，然后每天就拍一些不知所云的东西美其名曰艺术，每天都在追求拍摄一些很当代的照片想要极力表现他的某种思想。当第一次看到这类照片的时候会觉得这种风格很酷，但是看多了就会发现非常乏味，似乎摄影审美也是有趋同性的——不同人照片逐渐变得越来越一样，这些人不是在拍自己的照片而是想复刻大师的照片，他们觉得拍了一张构图和色彩风格很像某某大师的作品后就觉得很牛逼。的确很牛逼，技术上肯定没得说，但是这种照片拍一张就够了，不需要重复那么多经典了。 我觉得拍照和写作文是一样的，高考作文都有固定的格式按照三段论来叙述，这种写法保证了得分，但是我相信不会有人爱看这种文章的。如果一篇作文里，只不过重复一些名人名言，那充其量只能说这个人看的名人名言比较多，而不能说他文章写的好。 因此，我认为好的照片是发自内心想去拍摄的、想去表达的，至于用什么形式都可以，没有必要拘泥于某种风格，表达应该是多元化的，不同的表达方式应该是平等的，否则会导致照片”匠气“非常重，没有灵性，风格单一，所以在看一些孩子拍摄的照片的时候，虽然没什么技巧但是很照片真诚，就很容易打动我。比如你会看到这些孩子拍的照片拍照吧，少年！———听，少年们是这么说的！ (qq.com)： 我卷起瑜珈垫，顺着洞刚好看到了电灯泡。当时，我觉得特别像时光隧道，就拍了下来 。 围观老妈做饭时，我突发灵感：那碗中的蛋清像脸盘，蛋黄像眼睛，那我再加上嘴巴眼睛点缀 一下更生动了。作品就这样形成了 。 这张是我坐在大姨身后，左手颤抖着拍了一张，当时太阳照在大姨和表弟的身上，海风扬起了大姨的头发。最后在查看照片的时候，我才发现一股浓浓的母爱扑面而来。 该不该为了接触异性而拍照先说结论：可以但没有必要。就像这位up说的，当你去给别人拍照的时候，就不应该抱有其他莫名奇妙的幻想，把自己定位成为一个工具人就好了，本质上你是再给别人服务，在这个过程中拍摄者和被摄者都是有压力的——拍摄者担心自己拍得不好看，被摄者担心自己长得不好看。你不得不认清这样一个事实：不过不是职业模特，再漂亮的女生面对镜头的时候都会有压力。因此，人像摄影师最重要的能力是能够活跃气氛、引导模特让模特放松下来，在这个过程中如果你是一位”正经“的摄影师都是在思考是如何捕捉模特最自然的瞬间。如果，你抱有进一步接触的想法，那就不要拍摄了，不如好好约人家女生去吃饭看电影喝咖啡（而不是再去约拍她），想通过摄影进一步发展，真的是不太可能的（即使你真的很帅）。 我之前约拍的模特，除了约拍的时候有聊天，其他时间人家根本不会主动理我，我认为本质上人家是出于目的性的社交——她为了拍照所以需要摄影师，当这个目的实现后，人家就没必要再继续这段社交了（也不排除在这个过程中男女双方发现彼此非常适合做终生伴侣，但我认为概率不大）。 当然，如果你想提高人像技术，你可以去约拍，很多人问我怎么去约到女生，其实很简单：主动+真诚。 我记得我刚玩摄影的时候什么都不会，但是我”脸皮厚 “，主动去询问网上或者路上的陌生人能不能给她们拍照，真诚地说清楚自己的目的，结果不到一个星期就约到了三个女生。于是就拍下了这些照片： 这些都是我学摄影一个月后拍的人像，能拍成这种程度，我现在都觉得很满意（主要还是拍摄前做了很多功课）。 结论总之，我认为摄影应该是轻松的、没有压力地自我表达的、平等的、私人的、满足自我需求为第一的、主客观相统一的一件事情。 END","categories":[],"tags":[{"name":"摄影","slug":"摄影","permalink":"http://hi-nikola.cn/tags/%E6%91%84%E5%BD%B1/"}]},{"title":"Pandas基础知识笔记","slug":"pandas基础知识笔记","date":"2023-06-10T13:54:06.000Z","updated":"2023-12-22T09:41:00.471Z","comments":true,"path":"2023/06/10/pandas基础知识笔记/","link":"","permalink":"http://hi-nikola.cn/2023/06/10/pandas%E5%9F%BA%E7%A1%80%E7%9F%A5%E8%AF%86%E7%AC%94%E8%AE%B0/","excerpt":"工作中会用到阿里云的pyodps，经常调用pandas的API，于是整理了这篇教程。我觉得pandas理清三个概念就够了——属性、方法、索引，记住常用的语句，其他的都可以现用现查。写pandas的时候思路可以按照写SQL的思路来，这样脑子才不会乱，即能够使用pandas实现：表的创建删除、增、删、改、查、分组、排序、表关联。 最后，在文中附上非常全的pandas文档、教程、数据分析项目链接，真的百分百够用了。","text":"工作中会用到阿里云的pyodps，经常调用pandas的API，于是整理了这篇教程。我觉得pandas理清三个概念就够了——属性、方法、索引，记住常用的语句，其他的都可以现用现查。写pandas的时候思路可以按照写SQL的思路来，这样脑子才不会乱，即能够使用pandas实现：表的创建删除、增、删、改、查、分组、排序、表关联。 最后，在文中附上非常全的pandas文档、教程、数据分析项目链接，真的百分百够用了。 教程参考资料 datawhale ：仓库：https://github.com/datawhalechinapandas：http://joyfulpandas.datawhale.club/Content/index.htmlnumpy：https://github.com/datawhalechina/powerful-numpymatplotlib：https://datawhalechina.github.io/fantastic-matplotlib/ pandas官网：教程：https://pandas.pydata.org/docs/index.html 数据分析项目：https://www.heywhale.com/home 如果你之前学习过机器学习，肯定会知道西瓜书，和西瓜书配套的教程是南瓜书，这本书就是datawhale开源的。他们的数据分析（pandas、numpy、matplotlib）教程写的也是非常棒。 pandas的官网教程写的也是非常详细，主要是三部分：getting start、user guide、api reference，熟悉了之后工作中用到什么就直接查api，非常方便，官方给了详细的示例。 如果实际工作中如果没有项目用到pandas，可以在heywhale社区中找到许多项目供自己练习，并且也可以参考他人写的代码。 学完基础知识之后，可以试试kaggle的24道练习题测试以下自己是否掌握： Pandas 24 useful exercises with solutions | Kaggle How to create a series from a list, numpy array and dict? How to combine many series to form a dataframe? How to get the items of series A not present in series B? How to get the items not common to both series A and series B? How to get useful infos How to get frequency counts of unique items of a series? How to convert a numpy array to a dataframe of given shape? (L1) How to find the positions of numbers that are multiples of 3 from a series? How to extract items at given positions from a series? How to stack two series vertically and horizontally ? How to get the positions of items of series A in another series B? How to compute difference of differences between consequtive numbers of a series? How to convert a series of date-strings to a timeseries? How to filter words that contain atleast 2 vowels from a series? How to replace missing spaces in a string with the least frequent character? How to change column values when importing csv to a dataframe? How to import only specified columns from a csv file? How to check if a dataframe has any missing values? How to replace missing values of multiple numeric columns with the mean? How to change the order of columns of a dataframe? How to filter every nth row in a dataframe? How to get the last n rows of a dataframe with row sum &gt; 100? How to find and cap outliers from a series or dataframe column? How to reverse the rows of a dataframe? numpy pandas 笔记笔记代码地址：pandas基础知识笔记-Nikola (gitee.com) numpy基础数组有一维数组和多维数组，重点需要掌握数组的创建、数组的索引切片。 numpy 创建形成的是一个numpy.ndarray对象。其实就是里面是一个列表或者列表里面包含列表。 直接列表构造 等差构造 随机构造 特殊数组 # array 直接构造 np.array([&#39;a&#39;,&#39;b&#39;,1,2]) # 一维 np.array([[1,2,3],[4,5,6]]) # 多维 # 等差构造 np.arange np.arange(1,10,3) # 随机构造 np.random.randint(1,10,3) # 特殊数组 np.zeros((3,4)) 数组的变形、转置 转置 变形 reshape shape 两种方式 # 转置 np.zeros((3,4)).T # 变形 # 方式一： np.zeros((3,4)).reshape(2,6) # 方式二 ： n =np.zeros((3,4)) n.shape= (6,2) 数组的索引和切片切片，左闭右开 [start:stop:step] 一维数组 二维数组 利用数组索引数组 # 一维 n = np.arange(13,1,-1) n[2] n[-2] n[1:3] n[:4] n[:4:2] n[1:5:2] # 二维 # n.reshape(3,4) n.shape = (4,3) n[2] # 只取到了第一层 n[1:3:2] # 步长为2 n[-1] n[1,1] # 取到了第二层 # 利用数组索引数组 n1 = np.array([2,1]) # 取出索引为2,1的值 n[n1] 常用方法 where # 指定满足条件与不满足条件位置对应的填充值 any all # any存在一个 True 或非零元素时返回 True ；all 当所有为True时返回 True diff # 和前一个元素作差 创建空值 # np.nan 判断空值 # np.isnan() 统计函数 max min mean # 很多 只列出这几个 # where n = np.array([-1,-3,-5,0,1,6,9]) np.where(n&gt;0,n,-666) # n中的值大于0时，等于它本身，否则为填充值 # any all n = np.array([-1,2,0]) # 存在一个0元素 n.any() # np.any(n) 两种写法都可以 # diff n = np.arange(1,15,3) np.diff(n) # 统计函数 max min n= np.array([0,3,7]) # 无空值时 n.max() n= np.array([0,3,7,np.nan]) # np.nan 创建空值 np.isnan(n) # 判断空值 n.max() # 无法判断最大 np.nanmax(n) # 要使用nan**函数 pandaspandas 两种基本的数据结构：series 、 dataframe series 创建 字典 列表 字典＋列表 numpy 数组 # 字典 dict = &#123;&quot;a&quot;:1,&quot;b&quot;:2,&quot;c&quot;:3&#125; pd.Series(dict) # 列表 list = [1,2,3,&quot;a&quot;] pd.Series(list) # 列表+字典 dl = &#123;&quot;a&quot;:[0,1,2],&quot;c&quot;:[&quot;f&quot;,4]&#125; pd.Series(dl) # numpy 数组 n = np.arange(1,10,2) pd.Series(n) Series 属性 shape size index values dtype n = np.random.randint(1,100,10) s = pd.Series(n) s.shape s.size s.index s.values type(s.values) # numpy.ndarray s.dtype Series 方法 s.head() s.tail() s.info() s.append() # 括号里是series df &#x3D; pd.concat([s1,s2],ignore_index&#x3D;True) s.drop() # 删 s[?] &#x3D; ? # 改 s.sort_values() # 排序 s.groupby() # 分组 s.to_list() # 转化成列表 s.isnull() # numpy 中只能用np.isnan() ， pandas中两者都可以用 series.value_counts() # 每个元素个数 series.count() # 元素个数总和 series.unique() # 去重后的元素 series.nunique() # 去重后的元素个数总和 。注意和 count()方法区别 series.isin([xx,xx]) s.head() s.tail() s.info() # 增 append . 添加的必须是series s1 = pd.Series(np.array([1,2])) # s.append(s1,ignore_index=True) # 索引ignore pd.concat([s,s1],ignore_index = True) # 删 series = pd.Series([1, 6, 6 ,3, 4, 5]) series.drop(2) # 删除的是对应的索引 series.drop([1,2]) # 改 series[4] = 666 series # 排序 series.sort_values(ascending= False) # 分组 # groupby() # 转列表 series.to_list() # 判断空值 series.isnull() # 注意区分numpy的np.isnan() series.isna() series.value_counts() # 每个元素个数 series.count() # 元素个数总和 series.unique() # 去重后的元素 series.nunique() # 去重后的元素个数总和 。注意和 count()方法区别 series.isin([1,6]) # 判断 某某值 是否在其中 Series 索引 显式索引 隐式索引 看得到的叫做显式索引。 注意：显式索引左闭右闭，隐式索引左闭右开 s = pd.Series(np.arange(2,11,3),index=[&quot;x&quot;,&quot;y&quot;,&quot;z&quot;]) s[&quot;x&quot;] # 显式索引 s[0] # 隐式索引 dataframe 创建dataframe 是由series 组成，因此同创建series的方式相同 字典+列表创建 numpy 创建 字典+numpy # 字典创建 list1 = &quot;hello the cruel world&quot;.split() # 列表 list2 = [100,200,300,400] dict = &#123;&quot;word&quot;: list1,&quot;num&quot;:list2&#125; # 注意 ：必须是列表！！！ df = pd.DataFrame(dict) # numpy 创建1 np1 = np.arange(1,12) np2 = np.arange(12,23) data = [np1,np2] df = pd.DataFrame(data) # numpy 创建2 n = np.arange(1,13).reshape(3,4) df = pd.DataFrame(data=n,columns=[f&quot;u&#123;i&#125;&quot; for i in range(1,5)],index=[&#39;index1&#39;,&#39;index2&#39;,&#39;index3&#39;]) # 字典＋numpy(series) data =&#123;&quot;a&quot;:np.arange(1,5),&quot;b&quot;:np.arange(6,10)&#125; df = pd.DataFrame(data) dataframe 属性 df.shape df.size df.columns df.index df.values df.dtypes df = pd.DataFrame(data=np.arange(2,14).reshape(3,4),columns=[&quot;a&quot;,&quot;b&quot;,&quot;c&quot;,&quot;d&quot;],index=[&quot;x&quot;,&quot;y&quot;,&quot;z&quot;]) df.shape # (3,4) df.size # 12 df.columns # Index([&#39;a&#39;, &#39;b&#39;, &#39;c&#39;, &#39;d&#39;], dtype=&#39;object&#39;) df.index # Index([&#39;x&#39;, &#39;y&#39;, &#39;z&#39;], dtype=&#39;object&#39;) df.values # 数组 df.dtypes dataframe 方法 df.head() df.tail() df.info() df.isin([x,x]) # 是否 df.isnull() df.apend() # 增 类比成字典 df.drop() # 删 在drop系列 axis &#x3D; 1 列。 df[“xx”].unique() df[“xx”].nunqiue() df[“xx”].value_counts() df.head() df.tail() df.info() df.isin([5,6]) df.isnull() # 增 append s = pd.Series([55,44,11,22],index= [&#39;a&#39;, &#39;b&#39;, &#39;c&#39;, &#39;d&#39;],name = &quot;vv&quot; ) # s.name = &quot;v&quot; df = df.append(s) # 这里如果不忽视索引的话 就需要给一个name给series # dataframe 和 dataframe concat df1 = pd.DataFrame(&#123;&quot;a&quot;:[22],&quot;b&quot;:[33],&quot;c&quot;:[44],&quot;d&quot;:[55]&#125;,index= [&#39;vvv&#39;]) # 注意 这里是dataframe 对应的是index。 pd.concat([df,df1]) s1 = pd.Series([111,222,333,444] ) s1.index = [&#39;a&#39;, &#39;b&#39;, &#39;c&#39;, &#39;d&#39;] # 这里需要设置series 的索引 df2 = pd.concat([df,s1.to_frame().T]) # s1.to_frame().T 这里需要将series转成dataframe再转置 # 增 增加一列 df2[&#39;e&#39;] = range(5) # 删 df2.drop(&quot;e&quot;,axis=1,inplace= True) dataframe 读取行列1.查看列： df[&quot;col1&quot;] # series df[[&quot;col1]] # dataframe df[[&quot;col1&quot;,&quot;col2&quot;]] # 注意双括号 查看行： loc 显式索引 左闭右闭 iloc 隐式索引 左闭右开 查看列 df2[&quot;a&quot;] df[[&quot;a&quot;]] # 通过布尔值取值 df[df[&quot;a&quot;]&lt;df[&quot;a&quot;].mean()] # 取所有true # 查看行 df.iloc[1] # 隐式 df.loc[&quot;y&quot;] # 显式 # 同时取行和列 df.iloc[1,2] # 行 列 df.loc[&quot;y&quot;,&quot;c&quot;] # 行列 df.loc[&quot;y&quot;,:] # 行 所有列 df.loc[&quot;y&quot;,[&quot;a&quot;,&quot;b&quot;]] # 行 指定列 df.iloc[[0,1]] # 注意双括号 df.loc[[&quot;x&quot;,&quot;y&quot;]] df.iloc[0:2] df.loc[&quot;x&quot;:&quot;z&quot;] 后面希望能有时间加上数据清洗的常用代码以及可视化的内容。 (PS:写教程太累了 看起来简单 实际上 自己写代码测试 、写知识点需要花费很长的时间 ，这次写教程我也发现最好的参考资料还得是官方文档，虽然是英文的，实际上文档非常易读。 )","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"http://hi-nikola.cn/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"在北京呆了两个月了，随便拍的一些日常","slug":"在北京呆了两个月了，随便拍的一些日常","date":"2023-06-04T14:06:31.000Z","updated":"2023-12-08T08:26:13.705Z","comments":true,"path":"2023/06/04/在北京呆了两个月了，随便拍的一些日常/","link":"","permalink":"http://hi-nikola.cn/2023/06/04/%E5%9C%A8%E5%8C%97%E4%BA%AC%E5%91%86%E4%BA%86%E4%B8%A4%E4%B8%AA%E6%9C%88%E4%BA%86%EF%BC%8C%E9%9A%8F%E4%BE%BF%E6%8B%8D%E7%9A%84%E4%B8%80%E4%BA%9B%E6%97%A5%E5%B8%B8/","excerpt":"四月初过来北京，已经呆了两个月了，没去什么景点，倒是喜欢逛北京的胡同和公园的，顺手拍了一些照片，分享在这里。","text":"四月初过来北京，已经呆了两个月了，没去什么景点，倒是喜欢逛北京的胡同和公园的，顺手拍了一些照片，分享在这里。 胡同里充满生活气息。吃的也很多，价格不贵。 夜晚的胡同，风吹得很舒服，很安静。 没想到居然在北京发现了黄鹤楼包子…… 胡同里的各种凉菜味道真不错。 藏在树林后的罗森。 平安二字值千金。 每天上班都要路过琉璃厂。 北京花特别多，路上、公园到处都是。四月份过来，就看到了海棠、丁香、月季，还有各种说不上名字的花。 北京的月季开得是真好看，好热烈！ 逛北海公园发现的珍珠一样的花。 葫芦娃。 胡同里，墙上的画。 北京的老年人生活真丰富，不仅仅是跳广场舞，还有演奏各种乐器的，图中是吹口琴的大爷。 牛街附近，满墙的爬山虎。 结束。","categories":[],"tags":[{"name":"生活","slug":"生活","permalink":"http://hi-nikola.cn/tags/%E7%94%9F%E6%B4%BB/"}]},{"title":"回到童年","slug":"重回儿童","date":"2023-06-02T14:48:55.000Z","updated":"2023-12-08T08:26:13.831Z","comments":true,"path":"2023/06/02/重回儿童/","link":"","permalink":"http://hi-nikola.cn/2023/06/02/%E9%87%8D%E5%9B%9E%E5%84%BF%E7%AB%A5/","excerpt":"今天周五，办公室一下子轻松了起来，终于没有人催：敏哥模型跑完了没？潇哥昨天过生日，我们大家伙今天才知道，于是从生日聊着聊着，聊起了小时候玩过的游戏……","text":"今天周五，办公室一下子轻松了起来，终于没有人催：敏哥模型跑完了没？潇哥昨天过生日，我们大家伙今天才知道，于是从生日聊着聊着，聊起了小时候玩过的游戏…… 小的时候最早玩的游戏还是诺基亚的贪吃蛇，记得当时生病住院，就拿着手机一遍遍的冲破自己的最高记录。 后来，就去游戏厅玩街机，当时最火的是拳皇和三国，我最喜欢玩三国里的诸葛亮了，感觉放大招贼酷炫，但是血比较薄容易GG，我记得好像是投一次币有两条命，当时还小，没啥零花钱，基本都是家长给的早饭钱，然后我和我堂哥就不吃早饭拿着这个钱去打游戏。 又后来家里买了半智能机，可以上3G，当时流行玩“文字游戏”，比如当时比较火的是3GQQ，通过网页登录QQ账号于是就可以玩QQ花园——可以浇花、种花、收集各种种子、还可以送花给别人。里面也可以加入各种社群、参加各种活动，当时我拼命的增加的活跃度想给自己的那个社群添砖加瓦贡献力量，在那个社群里还认识了不少大哥哥姐姐，和他们还唠嗑聊天聊到半夜，当然现在已经记不清聊得什么内容了。当时有些半智能机上也有一些“动作武侠”类的小游戏，比如关公战秦琼等，现在还记得打开游戏界面显示的是“JAVA”的字样。 那个时候，家里有了DVD，可以用碟机放游戏光盘，然后连接手柄打游戏，当时最喜欢玩里面的魂斗罗、超级玛丽和坦克世界了。 上初中的时候，班里有同学买了学习机里面有几个游戏，最火的叫“雷霆战机”，下晚自习回宿舍躲过宿管查寝后，四五个人就在一个床上轮流着玩这个游戏。上了高中，英雄联盟啥的就火起来了。我玩过的游戏不多，但是小时候玩的那些却让我记忆深刻，虽然游戏简单甚至粗糙，但是当时就是非常入迷，即使是文字版的也能非常沉浸投入。 其实，在更早的时候，没有电子产品的时候，我和我的小伙伴依然有很多游戏娱乐。 小的时候我经常和表姐去河里捡贝壳并且选择好看的、能够带有彩色的贝壳收藏起来；我会在河里钓鱼捕虾，并且还能卖上不少钱；我会和朋友用泥土堆一个小灶，生火烤青菜、腊肉——这可能就是我人生最早的野炊了吧；小学的时候会和同学玩弹珠、卡片、丢沙包、跳皮筋、“背人撞架”。当时的物质条件不像现在这么好，但是我们总能创造出各种有意思的游戏，不需要昂贵的设备，只要拉起几个小伙伴，就会有人提议出一大堆玩的游戏，非常的丰富多彩。有时看着现在的小朋友我反而会觉得有点“可怜”，他们都是高度依赖电子设备，并且环境并没有农村那么丰富，比如城里的孩子没办法摸鱼捉虾、捕蝉、养鸡，所以想想我们那个时候还是很幸福的（当然，现在的孩子可能也会沉浸在他们的幸福童年游戏世界里，那些是我们这些已经长大的人感受不到的）。 小时候好像都是快乐的，我人生最快乐的时光应该就是小时候了。去年有段时间非常抑郁，我就非常怀念我的老家，我怀念门口的稻谷场、屋旁的梧桐树、屋后的竹林，以及菜园旁的晚饭花。我当时忍不住画下了那个记忆中的场景： 我总是记得，每当我放学回家，还没走到家门口，家里的小狗就大老远的跑过来接我，舔我的腿，对我猛地摇尾巴，恨不得爬到我的身上舔我的脸。 今天，和同事聊起小时候，他说他最喜欢小时候那个夏天的午后，热的寂静——蝉声都停止了鸣叫，路上一个人也没有，躺在凉席上，看着斑驳的树影，这个时候吹来一阵凉风，他说他就想以后能过上这种生活。 原来，长大后的我们，拼了命地努力奋斗，只不过是想让自己能够过上小时候的那种生活啊。 的确，在城市里，拥有属于自己的一片菜园都已经是奢望了。","categories":[],"tags":[{"name":"生活","slug":"生活","permalink":"http://hi-nikola.cn/tags/%E7%94%9F%E6%B4%BB/"}]},{"title":"生活是苦难的，我又划着我的断桨出发了","slug":"生活是苦难的，我又划着我的断桨出发了","date":"2023-05-30T13:53:51.000Z","updated":"2023-12-08T08:26:13.818Z","comments":true,"path":"2023/05/30/生活是苦难的，我又划着我的断桨出发了/","link":"","permalink":"http://hi-nikola.cn/2023/05/30/%E7%94%9F%E6%B4%BB%E6%98%AF%E8%8B%A6%E9%9A%BE%E7%9A%84%EF%BC%8C%E6%88%91%E5%8F%88%E5%88%92%E7%9D%80%E6%88%91%E7%9A%84%E6%96%AD%E6%A1%A8%E5%87%BA%E5%8F%91%E4%BA%86/","excerpt":"这两天北京都是阴天。很不喜欢阴天，一眼过去，总感觉灰蒙蒙的。 来北京已经快两个月了，从最开始的兴奋（之前特别想出差），到现在已经觉得很累了。公司让我后面长期投入到这个项目上，下个月应该也会找房子租房子了，虽然说的是可以预支付房租和押金但是我还是觉得好麻烦。 跑步已经保持三个月了，体重也减到了72kg，希望能够继续跑下去吧，每天下班溜溜圈还挺轻松的，希望自己的身体不要出其他问题了，到今年年底的时候再去做一次体检，那个时候看看还有没有脂肪肝啥的（哎，是的，就是脂肪肝，没想到我年纪轻轻，平时也没有胡吃海喝，没想到居然有脂肪肝了），现在我觉得人的健康才是第一位的，真的，我已经深刻的意识到了，身体的健康决定了自己能否更好享受到生活的快乐，身体不适的时候感觉天空都是灰蒙蒙的，整个世界都是压抑的。所以啊，钱啊房子啊车子啊，真的都是浮云。","text":"这两天北京都是阴天。很不喜欢阴天，一眼过去，总感觉灰蒙蒙的。 来北京已经快两个月了，从最开始的兴奋（之前特别想出差），到现在已经觉得很累了。公司让我后面长期投入到这个项目上，下个月应该也会找房子租房子了，虽然说的是可以预支付房租和押金但是我还是觉得好麻烦。 跑步已经保持三个月了，体重也减到了72kg，希望能够继续跑下去吧，每天下班溜溜圈还挺轻松的，希望自己的身体不要出其他问题了，到今年年底的时候再去做一次体检，那个时候看看还有没有脂肪肝啥的（哎，是的，就是脂肪肝，没想到我年纪轻轻，平时也没有胡吃海喝，没想到居然有脂肪肝了），现在我觉得人的健康才是第一位的，真的，我已经深刻的意识到了，身体的健康决定了自己能否更好享受到生活的快乐，身体不适的时候感觉天空都是灰蒙蒙的，整个世界都是压抑的。所以啊，钱啊房子啊车子啊，真的都是浮云。 之前和朋友聊天谈到了史铁生，最近有看到关于蔡磊的报道（京东集团前副总裁蔡磊患渐冻症4年：向死而生，决战渐冻|渐冻症|疾病_新浪科技_新浪网 (sina.com.cn)），突然觉得疾病真的很残忍，没办法想象在最美好的年纪，一下子换上了没办法治愈的疾病，甚至随时会死亡。但是，如果真有这么一天，命运不会怜悯任何人，疾病就随机降临到某个人的身上，他不管怎么样都得承受着，直到死亡。如果他勇敢的抗争，积极乐观的活着，在外人看来可能很坚强，但是就他而言他是别无选择。就像史铁生说的，如果暂时没办法死去，那就活着吧，既然活着那总要干点事情。我对这句话印象非常深刻，我觉得人最大的力量不是那种坚不可摧的自信和勇敢而是失望到低谷的那种反弹和韧性。 我也时常觉得人生没有希望了，我想：就像现在这么继续活下去吗？那这一生也真没什么意思了，就算我完成了自己人生一个又一个KPI又怎么样呢？会变得更好吗？ 是啊，会变得更好吗？这个世界会变得更好吗？我会变得更好吗 ？ 这个世界的好坏和我又有何干？我太渺小了，我的存在或者毁灭对这个世界没有丝毫影响，但是就算是一粒沙子，也会有它留恋的土地，我也时常觉得人生太美好了，能够去呼吸、能够去奔跑、能够沐浴在阳光下真的是一件美好的事情。 小的时候，我不停地追问自己，人生的意义是什么，到现在我都不知道人生的意义是什么，所谓的意义不过是人为地赋予，说到底人生就是一场没有意义的事情，甚至，在宇宙的角度，人类的存在也成了可有可无。 但是，在这个世界上生活了二三十年了，突然觉得追求意义本身就是没有意义的事情，当我看到花儿，闻到花香，听到鸟叫，我就觉得“好死不如赖活着”真是话糙理不糙啊。","categories":[],"tags":[{"name":"生活","slug":"生活","permalink":"http://hi-nikola.cn/tags/%E7%94%9F%E6%B4%BB/"}]},{"title":"年轻人为什么不能加班","slug":"为什么年轻人不能加班","date":"2023-05-27T02:41:37.000Z","updated":"2023-12-08T08:26:13.697Z","comments":true,"path":"2023/05/27/为什么年轻人不能加班/","link":"","permalink":"http://hi-nikola.cn/2023/05/27/%E4%B8%BA%E4%BB%80%E4%B9%88%E5%B9%B4%E8%BD%BB%E4%BA%BA%E4%B8%8D%E8%83%BD%E5%8A%A0%E7%8F%AD/","excerpt":"四月初来北京出差，投入国网的项目，因为项目快要全国推广，所以前期的准备工作很多，还需要不断地跑模型测试算法的准确性，这段时间加班很多，一般都是八九点离开办公室。听同事说全国推广的这两个月会更忙，要和省侧去不断磨合，解决他们的问题。我之前的工作基本是不加班的，面对这份加班的项目我也在思考“加班”这个问题。","text":"四月初来北京出差，投入国网的项目，因为项目快要全国推广，所以前期的准备工作很多，还需要不断地跑模型测试算法的准确性，这段时间加班很多，一般都是八九点离开办公室。听同事说全国推广的这两个月会更忙，要和省侧去不断磨合，解决他们的问题。我之前的工作基本是不加班的，面对这份加班的项目我也在思考“加班”这个问题。 我认为的理想工作时间现实一点的说，作为打工人每天9–18点上班时间，中午2小时休息时间，到点正常下班，已经是非常好的了，无奈目前国内的就业环境基本做不到18点能准时下班的。上次看到一个帖子吐槽： 企业是否遵守劳动法，与企业没有关系，而是ZF对这部法的重视，及监督如果ZF把《劳动法》的重视程度与各种税法保持一致，把偷税漏税逃税的惩罚力度用在执行《劳动法》上面。那可以大大增加企业对劳动者的违法成本。从而减少违法。只是编造一部法律，但不执行它；这其实跟纵容犯罪没什么两样了。 加班到底损失了什么 时间时间其实是个很笼统的概念，目前我加班是没有加班费的，一旦把工资折算成时薪就发现，这点工资根本不配打工人工作这么久。而且我越来越意识到一份工作干的越久越在重复劳动，而且工作上很多事情都是无意义的，领导为了KPI逼迫员工去做的事情。当然，我并不是说，一件事情重复干是一件多么不好的事情，熟能生巧是非常必要的，但是在工作中，打工人是被不断push的，做的事情是重复的，甚至是错误的。明知道这件事毫无意义，并且本来可以去创新的时间用去做毫无意义的重复的事情上，我觉得是非常不好的。并且加班意味着消耗了自己做其他事情的时间，之前的领导说“一个人的成长不仅仅是在8小时之内，也在8小时之外”，我是很认同的，就拿我来说，如果我6点下班，吃完饭回家休息一下，8点出去跑步，9点回来学习，11点多洗澡睡觉，我就有三四个小时的时间用来学习和运动，而不是加班，而且我在学习和运动上的收获绝对远远高于加班上的物质（升职、加薪）的收获。加班是在不断消耗自己如果把每天加班的3个小时投入到运动、学习中，这都是一笔不小的财富。有的人可能会杠我：你不加班难道就会学习吗？事实上，每个人都有选择怎么支配自己时间的权利，而不是让自己的时间损失在垃圾工作时间上。 精力不知道各位是不是这样的：加完班回家，身体、心理都很疲惫，脑子里面还是今天工作的内容，什么力气也没有，洗完澡刷刷手机就到了12点了关灯睡觉，一天就这么过去了，每天重复这样的生活。我加完班就是这样的，我会觉得我的精力都被抽干了，什么兴趣也没有，不想思考，没有精力，没有创作的欲望。上份工作中，我自己的时间比较多，我会经常徒步、摄影，我感觉自己的灵感会很多，能够拍下一些好的照片，但是自从加班后我发现，自己的创作欲望完全没有了，所以我意识到：艺术是有钱有时间的人的玩意，只有这样“闲得发慌”的人才能创造出来东西，不断被push的打工人，神经一直紧绷着，“眼睛被蒙住”根本看不到“加班之外的世界”。 健康这个就不用多说了，前几天左耳耗子突发心梗死亡，让我非常震惊，因为我前一天还在Twitter上看到他发推，第二天就要小道消息流出来说他死亡。知乎上也有非常多的人缅怀他：编程大佬陈皓（左耳朵耗子）心梗去世，你对他有哪些记忆？ - 知乎 (zhihu.com)。那么作为活着的人，更应该警惕，注意自身的健康，其实长期跑步运动可以锻炼心肺能力、保持体重，从而避免三高。 应该怎么避免 拒绝部分加班在目前这个环境下，拒绝所有加班肯定是不现实的，但是对于领导提出的不合理的任务，要及时提出意见，而不是哼哧哼哧的去干。能早点离开公司就早点离开。 思考在工作中一定要多思考，首先想办法提升自己的工作效率，其次要像领导一样思考整个项目的流程、计划，这样不仅可以站在更高层面看待问题，还能意识到领导的决定是否合理。 学习不断的学习，才能保证自己不断地进步，学习技术，学习管理，提升自己。 寻找合适的公司通过学习提升自己，让自己有了更多的选择权，就可以寻找与自己理念想匹配的公司。 做管理既然“痛恨”**领导，那就成为领导，努力让自己的手下不加班，努力争取更多的话语权和决策权。 最后，我其实想说：努力学习，全面提高自己才是打破“加班循环”的秘诀。 我越来越意识到时间的珍贵，我的时间少之又少，我的时间应该花费到做正确事情上，能够有时间去做自己想做的事情真的是一件幸福的事情，我真的有太多事情想去干了，因此，更要拒绝无意义的加班，留出更多的时间。","categories":[],"tags":[{"name":"思考","slug":"思考","permalink":"http://hi-nikola.cn/tags/%E6%80%9D%E8%80%83/"}]},{"title":"时间过得真快，我的博客已经一周年了","slug":"时间过得真快，我的博客已经一周年了","date":"2023-05-05T15:10:09.000Z","updated":"2023-12-08T08:26:13.789Z","comments":true,"path":"2023/05/05/时间过得真快，我的博客已经一周年了/","link":"","permalink":"http://hi-nikola.cn/2023/05/05/%E6%97%B6%E9%97%B4%E8%BF%87%E5%BE%97%E7%9C%9F%E5%BF%AB%EF%BC%8C%E6%88%91%E7%9A%84%E5%8D%9A%E5%AE%A2%E5%B7%B2%E7%BB%8F%E4%B8%80%E5%91%A8%E5%B9%B4%E4%BA%86/","excerpt":"这是我的第一篇博客（2022-4-28）：first test | Nikola的博客 (hi-nikola.cn)，当时刚刚买了域名，然后看B站教程学习如何在服务器上启WordPress，真的超级激动搞到了半夜一两点，当时那段时间每天想的就是怎么把自己的博客整的好看一点，用什么样的主题。一晃一年已经过去了，感觉时间过得太快了，我喜欢这种自由的互联网冲浪的感觉，因为在此之前我对网络的认识基本为零，大学专业也不是计算机网络相关的，后来转行做了数据，才开始了解这些，更重要的是我发现对于网络不仅仅只有微博微信，还有墙外的世界以及散落在数字世界中的独立博客。","text":"这是我的第一篇博客（2022-4-28）：first test | Nikola的博客 (hi-nikola.cn)，当时刚刚买了域名，然后看B站教程学习如何在服务器上启WordPress，真的超级激动搞到了半夜一两点，当时那段时间每天想的就是怎么把自己的博客整的好看一点，用什么样的主题。一晃一年已经过去了，感觉时间过得太快了，我喜欢这种自由的互联网冲浪的感觉，因为在此之前我对网络的认识基本为零，大学专业也不是计算机网络相关的，后来转行做了数据，才开始了解这些，更重要的是我发现对于网络不仅仅只有微博微信，还有墙外的世界以及散落在数字世界中的独立博客。 这一年通过写blog，我获得了什么？获得了什么呢？——实际上没有任何物质的回报，一个普通人通过极其“原始”的方式blog发布文章，没有任何流量推广机制，也没有什么SEO，基本上我的文章的唯一读者就是我自己。后来我开始通过newsletter竹白同步自己的blog才有了一百多个订阅者，但是现在已经停更许久了，原因有两点：一是最近一段时间工作比较忙，人也比较的累，基本没什么创作的欲望；二是我其实很害怕通过newsletter去打扰到别人，因为newsletter是推送机制的，也就意味着我的文章发布之后，所有的订阅者都会收到一条提醒，我内心是很害怕这种场景的，因为我觉得我的内容可能很平淡或者根本没办法给他人提供什么帮助，如果别人偶然订阅了我的newsletter但对我的内容并不特别感兴趣，我却还经常更新的话就会打扰到别人。因此，我最近的一些文章都是通过blog发布的，blog的一个好处就是“不打扰别人”，没有任何推荐机制和推送机制，如果别人想看你的博客直接输入网址就好了。我写博客的目的是记录自己的生活、学过的知识、分享自己的一些观点，这些本身就是琐碎的，（在他人看来）可能是毫无意义的，但是对我而言，这块地方是我数字世界中的自己，我记录下来我的琐碎，也正是这些才构成了完整的自己。前几天，申请了十年之约,未来会有朋友通过虫洞随机到我的blog，我也相信在茫茫世界中或许有一两个看到我的blog会和我共鸣的人（如果真的有）那真是一件美好的事情啊。最近看到一篇blog：Will AI kill blogging? | ᕕ( ᐛ )ᕗ Herman’s blog (bearblog.dev)，里面有这样一段话： Furthermore, the creative process behind crafting a blog is a meaningful and rewarding experience for the blogger. Through this process, they can reflect on their own thoughts, learn from their experiences, and engage with their audience in a way that is genuinely human. Ultimately, blogs are a person’s place to express themselves. Their planting of a flag in the digital realm. It is their shout into the void, their way of saying “this is me”. 尤其是在2023年“短而快”的内容“流行”的时间节点上，我觉得写blog是一件小众且“cool”的事情！更重要的是我还可以看到互联网上许许多多人通过长文分享他们的生活和经验，这本身就是一件美好的事情！ 这个blog未来的发展哈哈哈，用“发展”这个词语太高大上了。在接下来的日子里我准备——多更新！主要的内容有： 自己工作、阅读学习到的知识进行整理，发布到这里。（以后项目上带新人，遇到他们不懂得知识点，直接甩我的博客链接。多酷啊！） 记录自己的日常。之前的我很多想法、琐碎的事情都是写在备忘录或者写在ediary日记本里面，但是现在我觉得我绝大部分经历和思考都不是“隐私的”，这些内容都是可以公开的（更何况我的blog没人访问，如果有一天我出名了，等等，这个可能性为0！）。而且，我的很多奇思妙想还是挺有意思的。最糟糕的一种情况就是如果突发意外GG ——game over（呸呸呸），这些文字还是我的另一种存在的形式。 分享自己看到的英文blog。之前我尝试在博客里直接全篇翻译我阅读到的好的英文blog ，但是我觉得这种方式不太好，因为全篇翻译很累，而且对于读者（如果有读者的话）没有任何意义（直接Google翻译不比我翻译的要好要快吗？）。所以后面我准备只截取英文博客里的片段进行分享并且写下自己的想法，这样既保持自己英语阅读的习惯又能够留下自己的反思和想法，对于写作者是一种比较轻松的分享方式。 希望我能够坚持下去。我不喜欢用坚持这个词语，好像是强迫自己似的。我希望未来我能够自然而然的写下去。 It is my shout into the void, my way of saying “this is me”。","categories":[],"tags":[{"name":"生活","slug":"生活","permalink":"http://hi-nikola.cn/tags/%E7%94%9F%E6%B4%BB/"}]},{"title":"逛北京法源寺","slug":"逛北京法源寺","date":"2023-04-22T08:27:36.000Z","updated":"2023-12-08T08:26:13.831Z","comments":true,"path":"2023/04/22/逛北京法源寺/","link":"","permalink":"http://hi-nikola.cn/2023/04/22/%E9%80%9B%E5%8C%97%E4%BA%AC%E6%B3%95%E6%BA%90%E5%AF%BA/","excerpt":"四月出差北京，住在珠市口西大街旁胡同里，附近有北京天坛、陶然亭公园、纪晓岚故居，再往西走一走就到了法源寺。","text":"四月出差北京，住在珠市口西大街旁胡同里，附近有北京天坛、陶然亭公园、纪晓岚故居，再往西走一走就到了法源寺。 北京法源寺位于宣武门外教子胡同南端东侧。从宣武门外大街到菜市口大街，绕进烂缦胡同穿过西砖胡同就到了法源寺。 第一次听说法源寺是之前看李敖李大师聊过这本书，后来发现B站有这本书改编成的话剧——非常推荐值得一看，两个多小时，台词非常震撼，节奏非常的棒，让我了解到戊戌变法前后发生的种种。那个时期需要求新变法，但是改革政体却是不易，变法如果冒进，导致政局不稳，社会动荡，因此改革并不是一句口号，并不是一说改变就从上到下从里到外彻彻底底的改变，什么应该改，什么应该变，是那个时候剧烈争论的。这部话剧里，让各派势力有机会发声，站在他们的 角度诉说对戊戌变法的看法。如今最稀缺的文人风骨！【话剧】北京法源寺 1080p ai修复版_哔哩哔哩_bilibili相比于其他景区，法源寺真显得冷清，人不多，很安静，里面比较罕见的古树（国槐、银杏）和石碑。一圈逛下来大概半个小时，顺带着逛逛周围的胡同，非常的舒适，另外这里不得不提一句胡同里的小馆子味道真不错。 在这里有很多传闻：一是当年泰戈尔来北京，就在这法源寺和徐志摩相谈甚欢；二是当年齐白石来京穷困潦倒的时候晚上就住在法源寺，白天到琉璃厂卖画。 就在这么一个胡同巷子里，看起来极其普通的，寺庙不要门票，基本没看到什么管理人员，在这漫长的历史上居然发生种种故事还被流传下来，真觉得奇妙。不论传说是真是假，一个地方因为有了故事就变得神秘而有趣了。","categories":[],"tags":[{"name":"生活","slug":"生活","permalink":"http://hi-nikola.cn/tags/%E7%94%9F%E6%B4%BB/"}]},{"title":"docker安装使用postgresql","slug":"docker安装使用postgresql","date":"2023-04-01T04:58:37.000Z","updated":"2023-12-08T08:26:13.691Z","comments":true,"path":"2023/04/01/docker安装使用postgresql/","link":"","permalink":"http://hi-nikola.cn/2023/04/01/docker%E5%AE%89%E8%A3%85%E4%BD%BF%E7%94%A8postgresql/","excerpt":"因为之前docker接触的不多，来新公司之后公司数据库用的是pg，感觉安装很麻烦，于是试了一下docker安装，几分钟就搞定了，真方便！自从用了docker之后再也离不开它了！ 这里说一下，Windows电脑安装docker之前要安装wsl。这样就可以在Windows系统跑Ubuntu，直接命令行 wsl就进入了！","text":"因为之前docker接触的不多，来新公司之后公司数据库用的是pg，感觉安装很麻烦，于是试了一下docker安装，几分钟就搞定了，真方便！自从用了docker之后再也离不开它了！ 这里说一下，Windows电脑安装docker之前要安装wsl。这样就可以在Windows系统跑Ubuntu，直接命令行 wsl就进入了！ docker 安装和运行资料可参考： Ubuntu 20.04 Docker 安装并配置 - YahuiAn - 博客园 (cnblogs.com) Docker 1小时快速上手教程，无废话纯干货_哔哩哔哩_bilibili 🎉 Docker 简介和安装 - Docker 快速入门 (easydoc.net) DockerHub生命周期流程： docker的基本操作# 检查DOCKER状态 systemctl status docker # 启动docker systemctl start docker # 设置开机启动 systemctl enable docker # 查看帮助 docker --help # 查看 docker 镜像 docker images # 容器列表 状态 docker ps -a # 删除容器 docker container rm xxx # 启动容器 docker start [id] # 进入容器 docker exec -it [id或者name] /bin/bash 运行postgresql资料可参考： docker安装的postgresql的基本使用 - 明矾 - 博客园 (cnblogs.com)二. 连接PostgreSQL - 简书 (jianshu.com) postgresql语法 docker常用基本命令# 拉取镜像并运行 # -d 后台运行 postgres:12：指定使用postgres:12作为镜像 docker pull postgres:12 docker run --name postgres12 -e POSTGRES_PASSWORD=123456 -p 5432:5432 -d postgres:12 # 进入容器 docker exec -it postgres12 /bin/bash # 进入容器后 whereis psql # 连接数据库 psql -U postgres psql -U username -h hostname -p port -d dbname -U username 用户名，默认值postgres -h hostname 主机名，默认值localhost -p port 端口号，默认值5432 -d dbname 要连接的数据库名，默认值postgres # 查看所有数据库 \\list select datname from pg_database; # 创建数据库 create database TEST; # 版本 select version(); postgresql语法# 创建数据库 create database xxx ; # 查看数据库 \\list # 数据库改名 alter database db1 rename to db2; # 删除数据库 drop database xxx; # 进入数据库 \\c xxx # 查看表 \\d # 查看表结构 \\d xxx # 创建表 CREATE TABLE table_name( column1 datatype, column2 datatype, column3 datatype, ..... columnN datatype, PRIMARY KEY( 一个或多个列 ) ); CREATE TABLE DEPARTMENT( ID INT PRIMARY KEY NOT NULL, DEPT CHAR(50) NOT NULL, EMP_ID INT NOT NULL ); # 删除表 drop table xxx; # 表的修改 # 修改表名 alter table table_name rename to new_name ; # 修改列名 ALTER TABLE table_name RENAME COLUMN old_name TO new_name; # 修改列数据结构 ALTER TABLE table_name ALTER COLUMN column_name TYPE new_data_type; # 增加列 ALTER TABLE table_name ADD COLUMN new_column_name data_type; # 删除列 ALTER TABLE table_name DROP COLUMN column_name; # 查看当前数据库模式 \\dn # 创建模式(注意是在哪个数据库创建的) create schema xxx; # 删除模式 drop schema xxx; # 查看指定模式下的表情况 \\d 模式名.* 模式使用模式的优势： 允许多个用户使用一个数据库并且不会互相干扰。 将数据库对象组织成逻辑组以便更容易管理。 第三方应用的对象可以放在独立的模式中，这样它们就不会与其他对象的名称发生冲突。模式类似于操作系统层的目录，但是模式不能嵌套。 插入# 表插入多行（注意逗号） INSERT INTO 表名 (列1, 列2, 列3, ...) VALUES (值1, 值2, 值3, ...), (值1, 值2, 值3, ...), (值1, 值2, 值3, ...), ... 更新update [表名] set column1 = value1, column2 = value2...., columnN = valueN where id=xxx 删除DELETE FROM table_name WHERE [condition]; 自测题1. 数据库的创建、修改和删除；表的创建、修改和删除；数据的插入、修改和删除 2. 数据单表查询；多表查询；子查询；模糊匹配查询；查询运算（聚合、分组等）；窗口函数 3. 常见索引（B-tree、Hash等）的特点；创建、修改和删除索引 窗口函数：通俗易懂的学会：SQL窗口函数 - 知乎 (zhihu.com)数据：PostgreSQL练习_yws_2973199368的博客-CSDN博客","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"http://hi-nikola.cn/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"这次面试的一些反思和总结","slug":"这次面试的一些反思和总结","date":"2023-03-15T10:41:17.000Z","updated":"2023-12-08T08:26:13.831Z","comments":true,"path":"2023/03/15/这次面试的一些反思和总结/","link":"","permalink":"http://hi-nikola.cn/2023/03/15/%E8%BF%99%E6%AC%A1%E9%9D%A2%E8%AF%95%E7%9A%84%E4%B8%80%E4%BA%9B%E5%8F%8D%E6%80%9D%E5%92%8C%E6%80%BB%E7%BB%93/","excerpt":"之前有看LKS的一期模拟面试的视频，当时印象很深刻，觉得还挺全面的，有一些方面的确是之前自己没做到、没想到的。这一次找工作面试前特意去了他的主页把他相关的视频找来看了一下。于是根据这些面试视频结合自己面试的情况做一点总结。","text":"之前有看LKS的一期模拟面试的视频，当时印象很深刻，觉得还挺全面的，有一些方面的确是之前自己没做到、没想到的。这一次找工作面试前特意去了他的主页把他相关的视频找来看了一下。于是根据这些面试视频结合自己面试的情况做一点总结。 链接全程实录！2年全职UP主还能找到工作吗?_哔哩哔哩_bilibili 理想企业面试很难?只是套路而已丨LKs和十音的就业指导1_哔哩哔哩_bilibili 可能改变你职业生涯的写简历教程丨LKs和十音的就业指导2_哔哩哔哩_bilibili 找工作如何避开”坑人”公司丨LKs和十音的就业指导3_哔哩哔哩_bilibili 正文前期准备其实可以主要从以下几个方面着手： 着装 简历和公司JD的匹配度 各个平台的账号、文章、相关产品、业务（竞品分析 、公司产品对比） 相关行业报告 自我介绍准备 着装现在疫情全面放开后，大部分公司都问能不能到现场面试（有的是一面通过后，二面需要去现场的，我面试的公司中只有一家两轮面试都是电话），因为我自己投的是数据、python相关的岗位，所以我觉得作为技术、程序员穿的简单干净就好，我还专门买了hello world 的衣服，我觉得挺好玩的，穿起来也挺好看的（中二的）。当时去面试，面试官看到了我的衣服后微微一笑，然后说，“这衣服挺不错的”，我就知道有戏了。 匹配度简历的重要性不言而喻，网上有很多可以参考的模板，这里不再赘述，但是有三点可以注意： 简历不要花里胡哨，尽量选择简洁的模板，我推荐用Markdown或者latex去写，可能比较好点（这个是我的主观看法）。 像我这种投多种岗位的简历，做多份简历比较好，比如，数据相关一份、python相关一份。 一定要尽量和公司JD能够匹配。 我上一份工作主要是数据分析、报表开发相关的经历，但是按照目前的行情，如果只投数分可能很难约到面试，所以我就把岗位定的宽一定，不把自己太局限在某个领域，结果真的面试情况还可以，起码这个星期每天都能够保证有一个面试。 相关行业的了解LKS在面试前，就去了解学习了相关行业的大致情况、行业报告，以及面试公司的相关情况，比如公司涉及的业务、主要的产品、相关的竞品。在视频中，LKS面试的是游戏公司，他通过官网、微信公众号大概了解了公司，然后试玩了该公司的所有游戏，这样在面试的时候就可以就这个点深入的和面试官聊一聊自己的一些感受以及相关的思考，这一点我觉得是非常必要的，而且一定要这么去做的！其实，我之前都是海投，没怎么深入了解投简历的公司，就算去面试了，也是聊比较笼统的业务，但是，如果这个时候，我有提前看他们官网的业务以及产品，然后面试的时候提一下，我相信面试是很加分的。所以，在后面的面试中，我提前了解面试公司的情况、产品、业务，然后在自我介绍的时候着重强调一下，并顺带提一下公司的相关业务，面试官给的反馈都是挺不错的。 自我介绍自我介绍一定要滚瓜烂熟，并且要熟悉简历里涉及的每一个技术细节，要不然深挖简历的时候答不上来真的很尴尬！！像我面试python的岗位我就提前去github、牛客网找了相关的面试题和面经，对着面试题一条一条的过（很多知识点我不是很熟练，我就去百度），而且现在有了GPT后真的方便了很多，不懂得直接GPT一下，然后一直追问，这种以提问的方式来过知识点，我觉得学起来还是很快的。 心态有三点要注意： 自信 逻辑清晰 不要焦虑 真的一定要自信，就算自己很菜也要自信一点，面试是相互的、平等的，不存在谁高人一等，谁低人一等，不会的问题直接和面试官大大方方的沟通，像我这次第一次面试python开发（之前没有从事过互联网开发），面试官问了我一些传统互联网知识点，我没有回答上来，我知道很简单，但是我真的没有用过，比如高并发的常见解决方法，我当时也大概的说了自己的理解，然后真诚请教面试官。整个面试一个小时，问了我十几个问题，我可能就回答了三四个，其他的问题我都是直接现场请教面试官。我觉得我这种就是脸皮厚，不怕丢人，我深知面试是最好的学习机会，所以一定要抓住机会，而且每次面试我都会录音，然后回家后听几遍，主要有两个原因：一、面试中提到的问题、知识点、面试官的回答可能会遗忘，所以要录下来 二、听自己面试时语言表达，看看自己吐词是否清楚、逻辑是否清晰，看看自己有没有能够改进的地方。 薪资这个坑，我这次真的踩烂了！！！在了解具体薪资结构、福利待遇、工作强度之前一定不要说自己的期望薪资！！！一定要了解清楚之后再说！这次面试官问我，我就直接说了自己的期望薪资，面试官直接答应了，她可能觉得我太好谈了（所以，一定要提前学习一下面试的基本谈判技巧）。。。。。。 结尾今天面试完，基本已经确定offer了，工资有一定涨幅。然后发现自己又好久没写博客了，写一点东西吧，可能是废话，主要是我还挺想记录一下的。如果未来的读者从这篇文章中能够有一丁点儿收获，那就足够了。 当然，如果有可以讨论的地方，随时可以email。","categories":[],"tags":[{"name":"求职","slug":"求职","permalink":"http://hi-nikola.cn/tags/%E6%B1%82%E8%81%8C/"}]},{"title":"git的使用","slug":"git的使用","date":"2023-03-04T10:06:39.000Z","updated":"2023-12-08T08:26:13.691Z","comments":true,"path":"2023/03/04/git的使用/","link":"","permalink":"http://hi-nikola.cn/2023/03/04/git%E7%9A%84%E4%BD%BF%E7%94%A8/","excerpt":"git 版本管理真的是超级方便。分布式版本系统的最大好处之一是在本地工作完全不需要考虑远程库的存在，也就是有没有联网都可以正常工作，而SVN在没有联网的时候是拒绝干活的！当有网络的时候，再把本地提交推送一下就完成了同步，真是太方便了！","text":"git 版本管理真的是超级方便。分布式版本系统的最大好处之一是在本地工作完全不需要考虑远程库的存在，也就是有没有联网都可以正常工作，而SVN在没有联网的时候是拒绝干活的！当有网络的时候，再把本地提交推送一下就完成了同步，真是太方便了！ 对于文本类文件能够知道增加、删除了哪些内容（对于二进制文件 图片、word，就很难管理了)。Git管理的是修改，而不是文件。其中，我们要明白两个概念：工作区和暂存区。工作区是我们正常工程文件下的区域，暂存区是.git文件夹下的，当我们git add .文件后 文件被添加至stage暂存区。 Git教程 - 廖雪峰的官方网站 (liaoxuefeng.com)-讲的非常好！ 文件往Git版本库里添加的时候，是分两步执行的：第一步是用git add把文件添加进去，实际上就是把文件修改添加到暂存区；第二步是用git commit提交更改，实际上就是把暂存区的所有内容提交到当前分支。因为我们创建Git版本库时，Git自动为我们创建了唯一一个master分支，所以，现在，git commit就是往master分支上提交更改。 添加、提交git init git add readme.txt -- 一次可以多次添加文件，再一起commit git commit -m &quot;add readme.txt&quot; 查看本地修改内容git satus -- 查看暂存区和工作区文件的状态：哪些文件做了修改、哪些文件还未提交。 git diff readme.txt -- 也可以不加具体的文件，查看暂存区和工作区文件的修改区别。 查看提交日志和恢复到指定版本git log -- 查看提交记录 记录了每一次提交的内容和commitid git log --pretty=oneline --显示更简洁的log信息 git reset --hard xxx -- xxx表示commitid 会退到指定的版本。这个时候再git log查看 已经到了该版本啦 当回退到指定版本后，想恢复，但是这个时候没办法在控制台找到commitid了，这个时候 git reflog ---- 记录了每一次提交的id 381c40d HEAD@&#123;0&#125;: reset: moving to 381c4 f83abc6 HEAD@&#123;1&#125;: reset: moving to f83abc 381c40d HEAD@&#123;2&#125;: reset: moving to 381c f83abc6 HEAD@&#123;3&#125;: reset: moving to HEAD^ 381c40d HEAD@&#123;4&#125;: commit: all f83abc6 HEAD@&#123;5&#125;: commit (initial): wrote a readme file 一个文件修改了如何撤销？对于文件的状态有下面几种情况： 文件修改了没有git add 到缓存区 – git status查看，根据提示修改 # 位于分支 master # 尚未暂存以备提交的变更： # （使用 &quot;git add &lt;file&gt;...&quot; 更新要提交的内容） # （使用 &quot;git checkout -- &lt;file&gt;...&quot; 丢弃工作区的改动） # # 修改： test.txt 文件git add到了缓存区 – 同理 文件git commit 到了分支 –git reset版本回退 文件git push到了远程 推送到远程仓库本地Git仓库和GitHub仓库之间的传输是通过SSH加密的，所以，需要设置:远程仓库 - 廖雪峰的官方网站 (liaoxuefeng.com) ssh-keygen -t rsa -C &quot;youremail@example.com&quot; 然后在github中添加公共钥匙。 git remote add origin git@github.com:hi-nikola/learngit.git -- ssh链接 git push -u origin master -- git push origin master 由于远程库是空的，我们第一次推送master分支时，加上了-u参数，Git不但会把本地的master分支内容推送的远程新的master分支，还会把本地的master分支和远程的master分支关联起来，在以后的推送或者拉取时就可以简化命令，不带u了。 查看git户主名和邮箱 git config user.name git config user.email # 绑定 git config --global user.email &quot;you@example.com&quot; git config --global user.name &quot;Your Name&quot; # 解绑 git config --global --unset user.name &quot;Your Name&quot; git config --global --unset user.email &quot;you@example.com&quot; 查看或者删除remote： git remote -v git remote rm origin 分支git branch -m 旧名字 新名字 git branch -m master main 查看分支：git branch创建分支：git branch &lt;name&gt;切换分支：git checkout &lt;name&gt;或者git switch &lt;name&gt;创建+切换分支：git checkout -b &lt;name&gt;或者git switch -c &lt;name&gt;合并某分支到当前分支：git merge &lt;name&gt;删除分支：git branch -d &lt;name&gt; 合并分支以及解决冲突：解决冲突 - 廖雪峰的官方网站 (liaoxuefeng.com)","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"http://hi-nikola.cn/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"English pronunciation --  International Phonetic Alphabet","slug":"English-pronunciation-International-Phonetic-Alphabet","date":"2023-02-24T07:17:19.000Z","updated":"2023-12-08T08:26:13.685Z","comments":true,"path":"2023/02/24/English-pronunciation-International-Phonetic-Alphabet/","link":"","permalink":"http://hi-nikola.cn/2023/02/24/English-pronunciation-International-Phonetic-Alphabet/","excerpt":"In this video ,I have learned how to use the International Phonetic Alphabet (IPA) to practice English pronunciation. This is my first time to know IPA before I only know 26 letters in English alphabet in my earlier study .","text":"In this video ,I have learned how to use the International Phonetic Alphabet (IPA) to practice English pronunciation. This is my first time to know IPA before I only know 26 letters in English alphabet in my earlier study . IPAImprove your English Pronunciation! | mmmEnglish In fact,there are 44 different sounds including vowels ,diphthongs and consonant. vowels diphthongs consonants including unvoiced and voiced vowel sounds note:https://www.wolai.com/hi-nikola/8ePP4W7y711xkXZxQQBuU9 different phonetic alphabet :学习音标，这一篇就够了 - 知乎 (zhihu.com)","categories":[],"tags":[{"name":"English","slug":"English","permalink":"http://hi-nikola.cn/tags/English/"}]},{"title":"born  a dog , died a gentlement","slug":"born-a-dog-died-a-gentlement","date":"2023-02-23T13:42:00.000Z","updated":"2023-12-08T08:26:13.691Z","comments":true,"path":"2023/02/23/born-a-dog-died-a-gentlement/","link":"","permalink":"http://hi-nikola.cn/2023/02/23/born-a-dog-died-a-gentlement/","excerpt":"There’s no concept that feels as timeless as a human’s love for their dogs. They’re members of the family, so we tend to apply many of our human traditions to them: birthday celebrations, Halloween costumes, and ultimately funeral or memorial ceremonies.没有一个概念像人类对狗的爱一样永恒。他们是家庭成员，因此我们倾向于将许多人类传统应用于他们: 生日庆祝活动，万圣节服装以及最终的葬礼或纪念仪式。","text":"There’s no concept that feels as timeless as a human’s love for their dogs. They’re members of the family, so we tend to apply many of our human traditions to them: birthday celebrations, Halloween costumes, and ultimately funeral or memorial ceremonies.没有一个概念像人类对狗的爱一样永恒。他们是家庭成员，因此我们倾向于将许多人类传统应用于他们: 生日庆祝活动，万圣节服装以及最终的葬礼或纪念仪式。 In many cultures, traditional** burial rites **involve **dedicating **a headstone in honor of the person lost. So naturally, people often remember their lost pets the same way. That doesn’t seem to have changed much at all over the last 80 years, as a recent discovery in a local park indicates.在许多文化中，传统的葬礼包括为死者奉献墓碑。所以很自然，人们经常以同样的方式记住他们死去的宠物。正如最近在当地公园发现的那样，在过去的80年中，这似乎并没有太大变化。 Zach Medlin was walking his dog, Serena, in Kiroli Park in West Monroe, Louisiana, when he noticed something slightly hidden. Upon closer inspection, Medlin saw that it was an engraved stone marker. This piqued his interest, Medlin told The Dodo.Zach Medlin在 Louisiana 遛狗，Serena 时，注意到有些东西有些隐藏。经过仔细检查，Zach Medlin发现这是一个雕刻的石碑。Zach Medlin告诉Dodo，这激起了他的兴趣。 “The inscription was covered by some pine straw. So I had to move the pine straw out of the way to read what the grave marker had to say.”&amp;#x20;“碑文被一些松草覆盖。所以我不得不把松草移开，读墓碑上的字。“ When he fully uncovered the stone, he saw the inscription: “Buddie, 1928 – 1942. Born a dog, Died a gentleman.” In the middle of this 150-acre park, there was a headstone for a good boy who died 80 years ago.当他完全揭开石头时，他看到了铭文: “1928-1942。在这个占地150英亩的公园中间，有一个80年前去世的狗狗的墓碑。 Medlin stopped to wonder about Buddie and the people who loved and gave him a proper burial. He felt touched.“It warms my heart to know that Buddie carried his owners through the Great Depression. All dogs deserve a grave marker.”Medlin停下来想Buddie和那爱他并给他适当葬礼的人。他感到感动。“知道布迪带着他的主人度过了大萧条，我感到很温暖。所有的狗都应该有一个严重的标记。” Of course, it’s all a beautiful reminder of the strong relationship between people and their dogs, no matter how brief their time together. Buddie did live 13 years, and obviously, he lived a full life. Medlin shared a photo of Buddie’s resting place to the popular Facebook group“Dogspotting,” and of course it **resonated **with many. The post now has over 58,000 likes and 1,300 shares. 当然，这也是一个很好的提醒——狗和主人之间深厚的感情，不管在一起的时间多么短暂。Buddie 活了13年，很明显，他活了他充实的一生。Medlin把Buddie埋葬的这个地方分享到了Facebook上一个热门群组“Dogspotting”上，结果引起了很多人的共鸣。这条post已经有58000个点赞和1300个分享。 So who was Buddie? A local **legend **says Buddie was the doggie mascot for a Boy Scout camp in the area. Other research implies he was an **Irish **Setter and a beloved family pet who frequently took walks at the park where he now lies buried. To be fair, even all those years ago Buddie was a pretty popular name choice for a dog.谁是Buddie？当地的传闻说，Buddie是该地区一个童子军营地的小狗吉祥物。其他研究表明，他是爱尔兰雪达犬和心爱宠物，经常陪他现在埋葬的公园里散步。客观来讲，即使很多年前，Buddie也是狗的一个相当受欢迎的名字选择。 Whatever’s true about Buddie “the gentleman”‘s history, one thing is known for sure: someone really cared about him. His memory lives on through this subtle but permanent dedication in the park.To put it as **poignantly **as one Facebook commenter did: “I love Buddie. Now I will go hug my dog.”无论Buddie “绅士” 的历史是什么，有一件事是肯定的: 有人真的关心他。他的记忆通过公园里这种微妙但永久的奉献而继续存在。就像一位Facebook评论者那样凄婉地说: “我爱Buddie 。现在我要去抱我的狗。” 原文：https://punchmantra.com/2022/10/21/80-year-old-gravestone-honors-dog-who-died-a-gentleman/ 笔记：https://www.wolai.com/hi-nikola/iqFDqbN4kKp8h3GscJLN1A","categories":[],"tags":[{"name":"English","slug":"English","permalink":"http://hi-nikola.cn/tags/English/"}]},{"title":"What the great reopening means for China—and the world","slug":"What-the-great-reopening-means-for-China—and-the-world","date":"2023-02-12T06:52:11.000Z","updated":"2023-12-08T08:26:13.690Z","comments":true,"path":"2023/02/12/What-the-great-reopening-means-for-China—and-the-world/","link":"","permalink":"http://hi-nikola.cn/2023/02/12/What-the-great-reopening-means-for-China%E2%80%94and-the-world/","excerpt":"When its borders open on January 8th, China will have spent 1,016 days closed to the outside world. The country’s “zero-covid” policy has been a social and economic experiment without precedent: a vast public-health campaign that mostly kept the disease at bay; Xi Jinping’s pride and joy; and, by the end, a waking nightmare for many of China’s 1.4bn people.","text":"When its borders open on January 8th, China will have spent 1,016 days closed to the outside world. The country’s “zero-covid” policy has been a social and economic experiment without precedent: a vast public-health campaign that mostly kept the disease at bay; Xi Jinping’s pride and joy; and, by the end, a waking nightmare for many of China’s 1.4bn people. 当1月8日边境放开时，中国共花了1016天对外关闭。国家的清零政策成了有个没有先例的社会和经济实验：一场浩大的隔绝病毒的公共健康运动；习书记的自豪和喜悦；最后，对14亿中国人来说是一场噩梦。 Armies in white hazmat suits have been deployed to collect tens of billions of throat and nasal swabs. Millions were **quarantined **or **hauled **off to fever camps, often arbitrarily. Fear of **isolation **sent people fleeing from offices and factories where cases were found. **Amateur **videos captured residents leaping to their deaths from apartment blocks after weeks of seclusion. In major cities daily life stood still for months on end. A **cosmopolitan **class of young, wealthy Chinese was forced to come to **grips **with a life without international travel. Foreign entrepreneurs and executives were barred from returning to their homes and businesses in the country. 身穿白色防护服的大白（文中用的是army 军队）收集数百亿的喉捻子和鼻捻子（来检验病毒）。几百万人被随意（arbitrarily：in a way that does not seem to be based on a reason, system or plan and sometimes seems unfair）拉去方舱隔离。当某地发现阳性，害怕隔离的人从办公司或者工厂逃离。许多业余的视频拍下了那些经过数周的隔离从从小区跳楼而亡的人。在大多数城市，日常的生活停滞了数月。国际化阶层的年轻、有钱的中国人被强制过上了没有国际旅行的中国人。外国的企业家和董事被阻止返回到他们的家和事业上。 Before vaccines were widely available, officials could argue this approach was needed to save lives. By the end, the experiment offered a **bleak **existence at an extraordinary cost. China’s economy probably grew by less than 3% in 2022. Over the past 18 months, it has **forgone **about $1trn-worth of gdp, according to Oxford Economics, a research firm, compared with what it would have produced had its reopening **resembled **the rest of the world’s. Restrictions on movement **snarled **the most advanced global supply chains. In November profits at industrial firms dropped by 9% year on year. Meanwhile, exchanges between China and the outside world fell to their lowest in decades. Few foreign students remain. Overseas tourism has collapsed. Mr Xi has only recently **resumed **foreign travel after remaining in China for two-and-a-half years. 在疫苗被广泛普及之前，官方认为这种方法是被需要来拯救生命。到最后，这个实验是毫无意义的存在以其高昂的开销。2022年，中国的经济增长可能低于3%。根据牛津经济研究院的研究，在过去十八个月的时间里，和已经开放其他相似的国家比，中国放弃了大约价值1万亿的GDP。运输的限制牵制了最先进的全球供应链。11月，工厂的利润同比下降了9%。其中，中国和世界各国的的贸易达到了近十年来最低。基本没有外国学生留下来。海外旅行也暴跌。习主席最近重启国际旅行，在中国停滞的2年1个月后。 Zero-covid lasted longer than anyone initially expected, then collapsed faster than anyone could have imagined. In a matter of weeks China has gone from some of the world’s strictest restrictions to almost none. For the population at large, fear of lockdowns and quarantine has vanished. Following a period of turbulence, economic activity is likely to **rebound **sharply. Increased demand for energy and **commodities **will be felt around the world. **Investors **and multinational executives will soon be able to visit offices and factories. The great reconnecting of China with the outside world marks the end of an era: that of the global pandemic. 清零政策持续的时间比任何一个人最初预想的时间都要长，最后结束的比任何人想的都要突然。在数周的时间里，中国从最严厉的封锁到到无任何限制。对于这么多人来说，隔离的恐惧一下子消失。经历过一段时间的动荡，经济活动似乎一下子反弹，全世界对能源和商品都有大量的需求。投资者和跨国董事不久将能够来到办公室和工厂。中国和世界的重新连接标志着一个时期的结束：全球瘟疫。 Normality will not arrive immediately. According to one estimate, 37m people a day are catching covid. Hospitals are overwhelmed. So are crematoria. Officials acknowledge few deaths—and face an **immense **challenge keeping production lines running. Tesla, a carmaker, **halted **operations at its factory in Shanghai on December 24th. Local officials may **seal off **towns to keep cases down, worries an executive. The economy could **contract **in the first three months of opening up, says Tommy Wu of Commerzbank. But the recovery will arrive earlier than analysts had expected. Many think the period of **volatility **will draw to a close by the end of March. At that point, a recovery will begin that should gain strength as the year progresses. 常态不会立即到来。根据一项估计，每天有3700万人感染covid。医院不堪重负。火葬场也是。官员们承认死亡人数很少，并且面临着保持生产线运转的巨大挑战。汽车制造商特斯拉 (Tesla) 12月24日停止了其上海工厂的运营。一位高管担心，地方官员可能会封锁城镇以减少案件。Commerzbank的 Tommy Wu表示，经济可能会在开放的前三个月收缩。但复苏将比分析师预期的更早到来。许多人认为，波动期将在3月底结束。届时，随着一年的进行，复苏将开始。 Li Pengfei, until recently a product manager at an industrial-software firm in Beijing, is among those desperate for a return to normality. Mr Li lost his job in February when restrictions made basic duties, such as travelling to meet clients, near-impossible. He spent part of last year living with his sister, but was forced to return home to Jilin province in China’s far northeast, where economic prospects were **dismal **even before the pandemic. “Things seem so **volatile **that even the big companies are downsizing,” he says. 李鹏飞，北京一家工业软件公司的产品经理，他渴望恢复正常。李先生在2月失去了工作，当时限制使基本职责 (例如与客户见面) 几乎是不可能的。去年，他与姐姐住在一起，但是是被迫返回中国东北吉林省，那里的经济前景甚至在大流行之前就惨淡。他说: “事情看起来如此不稳定，以至于即使是大公司也在裁员。” Elsewhere in the world bosses worry about a “great resignation”, with workers quitting jobs or dropping out of the labour force altogether. This is less of a concern in China. The government did not hand out **stimulus cheques **willy-nilly, as America’s did, during the pandemic. People who lost jobs, such as Mr Li, will return to work when the opportunity arises, economists believe, helping to steady factory output. 在世界其他地方，老板们担心 “大辞职”，工人辞职或完全退出劳动力大军。在中国，这不是一个令人担忧的问题。在大流行期间，政府没有像美国那样随意发放刺激支票。经济学家认为，失去工作的人，例如李先生，将在机会出现时重返工作岗位，这有助于稳定工厂产出。 Consumption will rise, too. Incomes have fallen, but zero-covid also **squashed **spending, as people avoided travelling and eating out. All told, **households **saved one-third of their income last year. Many will be getting back on their feet after job losses, **stagnating **pay and declines in the value of their homes, meaning the **splurge **will be limited. But Jacqueline Rong of bnp Paribas, a bank, reckons household consumption will grow by about 9% in 2023—a big improvement on the previous year’s growth rate, if not full **retribution **for the enforced **abstemiousness **of recent years. 消费也会上升。收入下降了，但动态清零也压缩了支出，因为人们避免旅行和外出就餐。总而言之，去年家庭节省了3分之1的收入。在失业，工资停滞和房屋价值下降之后，许多将重新恢复，这意味着挥霍将受到限制。但是，法国巴黎银行 (bnp Paribas) 的杰奎琳·荣 (Jacqueline Rong) 认为，2023年家庭消费将增长约9%，这比去年的增长率有了很大改善，即使不完全报复近年来的强制性节制。 Reopening will also benefit China’s troubled property sector, though quite how much depends on political decisions. In November, as covid restrictions were relaxed, policymakers eased property developers’ access to financing. This should help stronger firms avoid default and at last finish building flats they have already sold to homebuyers. At China’s Central Economic Work Conference in December, policymakers promised to support “fundamental demand”, as opposed to speculative purchases. To that end, they may make further cuts to mortgage rates and down-payment requirements. 重新开放也将使中国陷入困境的房地产行业受益，尽管这在很大程度上取决于政治决定。11月，随着covid限制的放松，政策制定者放宽了房地产开发商的融资渠道。这应该有助于更强大的公司避免违约，并最终完成已经出售给购房者的公寓。在12月举行的中国中央经济工作会议上，政策制定者承诺支持 “基本需求”，而不是投机性购买。为此，他们可能会进一步降低抵押贷款利率和首付要求。 Forecasts for the performance of the property sector, broadly defined to include construction, services and furnishings, range widely. Activity in the industry could grow by 3% this year, according to Jing Liu of hsbc, a bank—enough to add 0.9 percentage points to China’s gdp growth. A more optimistic **scenario **has activity expanding by 5%, she thinks, adding 1.5 points to growth. Some households might decide that now is a good time to “buy the dip”, before prices **revive **or **regulatory **restrictions on home purchases return. 对房地产行业业绩的预测，广义上包括建筑、服务和家具，范围很广。汇丰银行 (hsbc) 的刘静 (Jing Liu) 表示，今年该行业的活动可能会增长3%，足以为中国的gdp增长增加0.9个百分点。她认为，更乐观的情况是活动扩大了5%，为增长增加了1.5点。一些家庭可能会认为，在房价复苏或对购房的监管限制回归之前，现在是 “买入下跌” 的好时机。 The economic implications of reopening extend further afield. Zero-covid kept a lid on China’s demand for global goods, services and commodities. During the lockdown of Shanghai in the first half of last year, for instance, the country’s oil demand fell by 2m barrels per day. In the past, such drops in Chinese spending would have **deprived **the world economy of a crucial engine of growth. The covid downturn has been different. It coincided with an overheated economy in America and an interrupted supply of energy across Europe. “At least this time China isn’t contributing to inflation,” says Louis Kuijs of s&amp;p Global, a rating agency. 重新开放的经济影响延伸到更远的地方。清零限制了中国对全球商品，服务和商品的需求。例如，在去年上半年上海封锁期间，该国的石油需求每天下降200万桶。过去，中国支出的这种下降将使世界经济失去关键的增长引擎。covid的低迷有所不同。恰逢美国经济过热和整个欧洲的能源供应中断。评级机构标准普尔全球 (s &amp; p Global) 的高路易 (Louis Kuijs) 表示: “至少这一次，中国没有助长通胀。” …… Deep damage has been done to parts of China’s supply chain. A covid outbreak, followed by protests, at a plant making Apple’s iPhone 14 in central China has delayed orders for the product. For foreign firms, the crisis was the first time that central policy **interfered **with local officials’ **commitment **to keep factories running. Many companies are now willing to pay more to manufacture elsewhere. Take the process of launching new products, which requires an almost continuous flow of researchers and scientists between headquarters, usually in the West, and plants in China. The covid years made this dance impossible. Engineers stopped visiting; fewer new products were launched in the country. Multinational firms have been forced, often reluctantly, to launch elsewhere. 对中国供应链的某些部分造成了严重损害。在中国中部生产苹果iphone14的一家工厂，covid爆发，随后抗议，推迟了该产品的订单。对于外国公司而言，这场危机是中央政策首次干扰地方官员保持工厂运转的承诺。许多公司现在愿意支付更多的费用去其他地方制造。以推出新产品的过程为例，这需要在总部 (通常在西方) 和中国工厂之间几乎连续不断的研究人员和科学家流动。covid的岁月使这种舞蹈变得不可能。工程师停止访问; 该国推出的新产品较少。跨国公司被迫 (通常是不情愿地) 在其他地方推出。 But after years of zero-covid, bosses have become more comfortable with moving away from China. Inbound investment in new “greenfield” factories has plummeted (see chart 3). At the same time, the number of firms moving operations out of China has jumped, says Alex Bryant of East West Associates, a supply-chain consultant. Most of the moves Mr Bryant’s firm has assisted with over the past year have been outbound. He thinks the reopening of China is unlikely to lead to an immediate turnaround in the direction of traffic. 但在经历了多年的零covid之后，老板们对离开中国变得更加自在。新 “绿地” 工厂的入境投资大幅下降 (见图3)。供应链顾问East West Associates的亚历克斯·布莱恩特 (Alex Bryant) 表示，与此同时，将业务转移到中国的公司数量激增。在过去的一年中，科比先生的公司协助采取的大部分举措都是外移的。他认为中国的重新开放不太可能导致交通方向的立即转变。 Policymakers are waking up to the danger. Officials and businessfolk from Fujian, Guangdong, Sichuan, Zhejiang and elsewhere are planning trips abroad to win back investors, according to a state-media report. “A meeting is worth a thousand emails,” it said. In December China’s leaders announced a focus on attracting foreign money, emphasising that local governments should prioritise finding investors. Such language has not been used at a Politburo meeting in many years, notes Robin Xing of Morgan Stanley, a bank. “They clearly want to keep their place in the global supply chain,” he says. Nevertheless, making up for the chaos of 2022 will require an awful lot of meetings.&amp;#x20; 政策制定者正在意识到这种危险。据官方媒体报道，来自福建，广东，四川，浙江和其他地方的官员和商人正计划出国旅行以夺回投资者。“一次会议值得一千封电子邮件，” 它说。12月，中国领导人宣布了吸引外资的重点，强调地方政府应优先寻找投资者。银行摩根士丹利 (Morgan Stanley) 的Robin Xing指出，这种语言多年来从未在政治局会议上使用过。“他们显然希望保持自己在全球供应链中的地位，” 他说。然而，弥补2022年的混乱将需要大量的会议。 note原文：What the great reopening means for China—and the world | The Economist 笔记：What the great reopening means for China—and the world (wolai.com)","categories":[],"tags":[{"name":"English","slug":"English","permalink":"http://hi-nikola.cn/tags/English/"}]},{"title":"新疆 新疆 11-24","slug":"新疆-新疆-11-24","date":"2022-11-26T10:53:40.000Z","updated":"2023-12-08T08:26:13.789Z","comments":true,"path":"2022/11/26/新疆-新疆-11-24/","link":"","permalink":"http://hi-nikola.cn/2022/11/26/%E6%96%B0%E7%96%86-%E6%96%B0%E7%96%86-11-24/","excerpt":"这起火灾造成重大人员伤亡教训深刻：一是居民家庭电气线路敷设安装不符合消防安全管理规定，埋下了火灾隐患。二是发生火灾的楼层常闭式防火门未保持关闭，导致火灾迅速蔓延扩大。三是着火小区道路狭窄，私家车停放混乱，影响消防车快速到场处置。四是部分居民自防自救能力弱，对居住建筑中通往楼顶的第二安全出口位置不熟悉，火灾发生时未进行有效的扑救及及时的逃生自救。","text":"这起火灾造成重大人员伤亡教训深刻：一是居民家庭电气线路敷设安装不符合消防安全管理规定，埋下了火灾隐患。二是发生火灾的楼层常闭式防火门未保持关闭，导致火灾迅速蔓延扩大。三是着火小区道路狭窄，私家车停放混乱，影响消防车快速到场处置。四是部分居民自防自救能力弱，对居住建筑中通往楼顶的第二安全出口位置不熟悉，火灾发生时未进行有效的扑救及及时的逃生自救。 新闻乌鲁木齐市“11-24”火灾事故新闻发布会： 乌鲁木齐市“11·24”火灾事故新闻发布会实录|善后|疫情|火灾_新浪新闻 (sina.com.cn) 关于网传是否存在小区静默三天、涉事居民楼逃生通道被铁丝捆绑的问题。经与吉祥苑小区所在街道、社区以及现场消防救援人员反复核实，小区不存在铁丝捆绑的问题，楼栋所有住户门、单元门均未封闭。网上所传楼层门用铁丝捆绑的图片为移花接木、恶意拼接。 关于网民质疑吉祥苑小区为“低风险，可下楼活动”问题。按照《新型冠状病毒肺炎防控方案（第九版）》和国家、自治区疫情防控有关规定，经综合研判评估，2022年11月12日起，吉祥苑小区由高风险区降为低风险区。随后，根据《关于有序恢复低风险区居民生活秩序的工作方案》，区疫情防控指挥部对吉祥苑小区防控队伍、基础台账、全员核酸检测、公共卫生环境整治情况等进行综合评估后，自11月20日起，吉祥苑小区居民已经实行错峰有序出户下楼、在小区内活动。 传言","categories":[],"tags":[{"name":"新闻","slug":"新闻","permalink":"http://hi-nikola.cn/tags/%E6%96%B0%E9%97%BB/"}]},{"title":"手机摄影全流程","slug":"手机摄影全流程","date":"2022-09-16T04:54:30.000Z","updated":"2023-12-08T08:26:13.724Z","comments":true,"path":"2022/09/16/手机摄影全流程/","link":"","permalink":"http://hi-nikola.cn/2022/09/16/%E6%89%8B%E6%9C%BA%E6%91%84%E5%BD%B1%E5%85%A8%E6%B5%81%E7%A8%8B/","excerpt":"首先，你不得不承认，手机摄影做的越来越优秀——无论是软件层面还是硬件层面，拍照变得更加方便、快捷，画质也越来越好，软件方面，APP store中也有许多第三方摄影APP可供选择。","text":"首先，你不得不承认，手机摄影做的越来越优秀——无论是软件层面还是硬件层面，拍照变得更加方便、快捷，画质也越来越好，软件方面，APP store中也有许多第三方摄影APP可供选择。 其次，我们必须改变这样一种观点：摄影一定要好的设备，必须要徕卡、必须要1.2的大光圈才能拍出好的照片。其实，当你阅片量足够大的时候，你会发现很多优秀的作品就是用最普通的设备拍出的，当你看到一张好的照片的时候，第一反应不应该是“这张照片是用什么设备拍出来的”而应该是“这张照片是怎么拍的，为什么好，有哪些地方值得学习的”，一张照片的好坏和设备无关，如果有了好的设备，拍的却很烂，那就是一张高清的烂片而已。每年各大手机厂商的手机摄影比赛中有很多优秀的作品，你可以从我往期的周刊中看到2022年iPhone手机摄影IPPA大赛的获奖作品：2022年IPPA摄影大赛获奖作品，我相信看完之后你会忍不住感叹：原来用手机也可以拍成这样！ 手机摄影也可以进行摄影艺术创作，不一定要依靠全画幅、中画幅。比如在现当代摄影史上极具分量的摄影师史蒂芬·肖尔（Stephen Shore）也在用苹果手机进行创作，并且在ins发表。 事实上，手机让摄影项目创作更加便捷，从拍摄到选片到修图到输出（社交媒体）都可以只在一个设备上进行。想起之前在象曰看到Nico的手机摄影项目作品——「你住过这里&#x2F;Moon Pool」，非常喜欢，作者把周遭的生活拍出来另一种感觉，正如文中所说： Nico的创作从来不拘泥于器材，是无忧无虑的，散漫的拍摄。当我了解到她的拍摄器材时非常吃惊，在她的摄影书中竟然百分之九十的照片都是用手机拍摄的，且就是普通的iphone，并不是像素很高所谓的拍照手机。她说“我不喜欢被沉重的相机限制行动，当与心仪的画面相遇时手头往往只有手机”。 我经常听到有人说手机摄影不正式、无法保持专注，我认为这种说法是片面、错误的，在实际使用中，手机让创作者快速构图、拍摄、后期——在极短时间内实现自己的想法，这是专业相机无法做到的，因为你无法随时随身携带相机（即使是最小的相机），但是你却可以做到手机不离身，相比于更加高清的画质，我认为能够随时捕捉到自己想要的画面才是更加重要（除非特殊题材、特殊场景）。当然如果你想打印冲洗成相片，只要相纸在十五寸以内，目前的主流手机应该是都能满足你的要求的。 这里具体谈谈我的拍摄流程。在拍摄上，我更喜欢用第三方软件lightroom，当然苹果手机自带的实况功能也非常强大（比如，捕捉理想的画面、长曝光等），但是为了稍微好一点的画质，我往往使用lightroom。比如下面这张照片就是我用lightroom拍摄的，DNG格式（一种用于数码相机生成的原始数据文件的公共存档格式），简单的说，就和RAW格式相同，能够记录更多的信息，更加方便后期操作，这张照片大小为4032x3024-14.3MB。 lightroom不仅可以拍摄DNG格式的照片，还可以对照片进行标记、管理、编辑、调色（绝大部分都是免费的，蒙版功能收费，但是一般用不到）。另外还支持非常强大的滤镜功能，我的软件中就导入了将近一百个滤镜。 我把滤镜的下载地址放在这里，（为你省下了一大笔钱了😉）。参考B站UP主搞艺术的小明：如何解决iPhone13&#x2F;13mini原生相机过度锐化的问题，并直出高画质胶片感照片。 滤镜链接: https://pan.baidu.com/s/1Tf2kl4zgkEBx65TqH-RUaw?pwd=abcd 提取码: abcd 。下载二维码如下： 通常情况下，我可以在lightroom这一个软件中就走完我所有的拍摄流程：拍照、选片、编辑、调色、导出，最后发布在朋友圈、微博、ins上。手机拍摄操作十分的简单，就两个操作：对焦和曝光。点击屏幕手机会自动对焦，下拉上划屏幕上的“小太阳”可以让屏幕变亮或者变暗，这个就是曝光。手机让摄影变得更加“傻瓜”、更加简单，我们只需要专注在怎么拍好照片上而非怎样使用器材上。 在拍摄上，如果你想要更简单的直出好看的颜色，可以选择胶片滤镜APP：NOMO、FIMO，里面有非常多有趣的滤镜，记得我最开始接触这类软件的时候，每天都在不停地拍拍拍，我想看看使用不同的滤镜，照片的颜色会发生怎样的变化。 如果拍人可以选择APP：醒图、激萌。记得最开始拍人像的时候，不知道怎么修图，我就看到有博主介绍过一些奇淫技巧：用激萌APP去一键修图，然后问客户喜不喜欢，最后再用电脑对照着去精修。 后期调色上，也可以选择其他软件，每个软件都有自己的优势，比如： 泼辣修图 snapseed 最后在照片的文字、组合上可以使用黄油APP（做出来的plog超级好看）以及美图APP（除了拼图功能其他的功能都没必要使用）。 这里总结一下这些工具的功能： 拍摄：lightroom、NOMO、FIMO、醒图、激萌 调色：lightroom、snapseed、泼辣 人像拍摄、修图：醒图、激萌 增加文字、边框：黄油相机 拼图：美图秀秀 文章终于写到了最后，回过来看这篇文章本来想写具体的拍摄流程的，但是写着写着变成了软件使用和介绍😅，但是后来想想，手机拍摄过程中除了思考怎么拍，其他的时间都是在使用这些工具，能够利用好工具是一个基本的能力。很多不用手机拍照的朋友可能压根就不知道这些软件，不知道原来手机摄影的软件生态已经这么丰富了，我希望通过本文，让这些朋友们知道：手机的摄影功能已经非常强大了，并且可以借助这些软件工具让自己的照片变得更好。但是，我也希望各位明白，工具只是手段而已，最重要的肯定是拍照本身即按下快门，如果愿意你可以不修图，不做任何后期，因为所谓后期只不过是锦上添花而已。一张照片的好坏在你按下快门的那一刻就决定了。 最后，我也希望每个人能够用手机记录下生活，记录下打动自己的某个瞬间，这个时候照片的好坏（客观上的评价）已经不再重要了，因为这张照片于你而言就是独一无二的。 参考 如何解决iPhone13&#x2F;13mini原生相机过度锐化的问题，并直出高画质胶片感照片 我的拍摄工作流（无屏幕相机、手机Lightroom、读卡器、硬盘备份） ☎️我的联系方式： 🧭我的个人网站：www.hi-nikola.cn 📧我的邮箱：hi-nikola@aliyun.com","categories":[],"tags":[{"name":"摄影","slug":"摄影","permalink":"http://hi-nikola.cn/tags/%E6%91%84%E5%BD%B1/"}]},{"title":"中秋小记","slug":"中秋小记","date":"2022-09-16T04:46:55.000Z","updated":"2023-12-08T08:26:13.697Z","comments":true,"path":"2022/09/16/中秋小记/","link":"","permalink":"http://hi-nikola.cn/2022/09/16/%E4%B8%AD%E7%A7%8B%E5%B0%8F%E8%AE%B0/","excerpt":"中秋回家一趟， 顺手记录。","text":"中秋回家一趟， 顺手记录。 一下火车，排队做核酸，支付宝自主申报，坐车回家。还没到家就接到几个电话，问我是否报备、确定我是否从武昌区回来，要求我隔离三天，并说等下就来封门。我当时就纳闷了低风险地区往返怎么层层加码。于是先打了12345市长热线询问，又打防控指挥部询问，得到的答复是：武昌区回来的要隔离三天，有相关疫情防控文件但是不公开。 为什么不能公开呢？我想，这大概就是法不可知，则威不可测的意思吧。 二小侄子今年上一年级了，一个班五十多个孩子，一个年级十个班。刚开学一周，老师就给学生们布置了任务要求一个月背诵一篇文章。大概内容如下： 我们生在红旗下， 长在春风里， 目光所至皆为华夏， 五星闪耀皆为信仰， …… 人民有信仰， 国家有力量， 民族有希望。 最后 实现中华民族伟大复兴 没想到，这么小的孩子都要承担起伟大民族的复兴了，尽管他还不知道“复兴”两个字怎么写。 三听他爸说已经给小侄子报了三个课外班了，一三四练字班、二五舞蹈班、周六上午画画班。每天下午五点半去接娃放学，六点送到课外班，上大概一个多小时的课，回家吃完饭大概八点，然后监督娃完成老师布置的作业，其间少不了和娃“大战三百回合”，例如，一个简单的加减法不会做，教了一次又一次，还是用手指头掰不出来正确答案，气的小夫妻揍了孩子一顿，娃大哭，夫妻二人哄孩子，然后继续教做作业。作业做完洗澡睡觉，大概九点多到十点，一天就这么过去了。 听到这么紧密的日程安排真替孩子难受，但是转念一想，毕竟是肩负着实现民族伟大复兴的重担，也难怪。 所谓的那快乐 赤脚在田里追蜻蜓 追到累了 偷摘水果 被蜜蜂给叮到怕了 谁在偷笑呢 我靠着稻草人 吹着风 唱着歌 睡着了 《稻香》 我那小侄子现在所谓的快乐就是周日可以和爸爸一起去看挖掘机。 小男孩好像都挺喜欢挖掘机的。 四坐火车回汉，无聊翻书。 看到一段丰子恺学琴的故事，他的音乐老师是李叔同，就是那位写“长亭外，古道边”的弘一法师。丰子恺说自己学习音乐的经历只感到艰辛与严肃，从未有过学习音乐的舒服。 我们的先生的教授音乐是这样地严肃的。但他对于这样严肃的教师生活，似乎还不满足，后来就做了和尚而度更严肃的生活了。同时我也就毕业离校，入社会谋生，不再练习弹琴。说起音乐演奏，总觉得是一种非常严肃的行为。我须得用了“如临大敌”的态度而弹琴，用了“如见大宾”的态度而听人演奏。弹过听过之后，只感到兴奋的疲倦，绝未因此而感得舒服。 那这个世界上有没有娱乐的音乐呢?作者最终还是在“同乐会”的席上遇到了。 同乐会就是由一部分同学和教师在台上扮各种游艺，给其余的同学和教师欣赏。游艺中有各种各样的演，唱，和奏。总之全是令人发笑的花头。座上不绝地发出哄笑的声音。我回看后面的听众，但见许多血盆似的笑口。我似觉身在大世界新世界一类的游戏场中了。我觉得这同乐会的确是“乐”！在座的人可以全不费一点心力而只管张着嘴巴嬉笑。听他们的唱奏，也可以全不费一点心力而但觉鼓膜上的快感。这与我所学习的音乐大异，这真可说是舒服的音乐。听这种音乐，不必用“如见大宾”的态度，而只须当作喝酒。我在座听了一回音乐，好似喝了一顿酒，觉得陶醉而舒服。 我又想到了那可怜的小侄子，想起他爸爸说娃是喜欢画画才给他报的画画班。 我希望小侄子以后在画画的时候不至于“如临大敌”、“如见大宾”。 五又翻一页，看到这样一段： 余初生时，怖夫天之乍明乍暗，家人日:昼夜也。怪夫人之乍有乍无，日:生死也。教余别星，日:孰箕斗;别禽，曰:孰鸟鹊，识所始也。生以长，乍暗乍明乍有乍无者，渐不为异。间于纷纷混混之时，自提其神于太虚而俯之，觉明暗有无之乍乍者，微可悲也。 《西青散记•自序》 读完觉得真悲伤。尘世匆匆，已经无暇思考，唯有到了“太虚之境”才“觉明暗有无之乍乍者，微可悲也”，这又是另一种可悲。 六 我从山中来，带着兰花草。种在小园中，希望花开早。一日看三回，看得花时过。兰花却依然，苞也无一个。 火车上的歌声响起，胡适先生的这首诗写的真好。我也要到武昌站了。 ☎️我的联系方式： 🧭我的个人网站：www.hi-nikola.cn 📧我的邮箱：hi-nikola@aliyun.com","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://hi-nikola.cn/tags/%E9%9A%8F%E7%AC%94/"}]},{"title":"精益数据分析-指标","slug":"精益数据分析-指标","date":"2022-07-28T09:14:15.000Z","updated":"2023-12-08T08:26:13.819Z","comments":true,"path":"2022/07/28/精益数据分析-指标/","link":"","permalink":"http://hi-nikola.cn/2022/07/28/%E7%B2%BE%E7%9B%8A%E6%95%B0%E6%8D%AE%E5%88%86%E6%9E%90-%E6%8C%87%E6%A0%87/","excerpt":"《精益数据分析》学习笔记 数据分析离不开对企业关键指标的跟踪。这些指标与你的商业模式（即营收来源、支出成本、客户数量以及客户获取策略的效果等）有关，因此往往十分重要。 数据不止会得出更好的决策，也能提高组织的效率。如果每个人都愿意接受数据启发的工作方式，你就能建立起自发的、扁平化的组织，因为你不再需要在组织中贯彻一个观点，只需要让事实说话就行了。你可以授权员工做更多的决策，承担更多的责任，只要他们有适当的数据来支持他们的决策。","text":"《精益数据分析》学习笔记 数据分析离不开对企业关键指标的跟踪。这些指标与你的商业模式（即营收来源、支出成本、客户数量以及客户获取策略的效果等）有关，因此往往十分重要。 数据不止会得出更好的决策，也能提高组织的效率。如果每个人都愿意接受数据启发的工作方式，你就能建立起自发的、扁平化的组织，因为你不再需要在组织中贯彻一个观点，只需要让事实说话就行了。你可以授权员工做更多的决策，承担更多的责任，只要他们有适当的数据来支持他们的决策。 基本概念 指标，用于衡量事物发展程度的单位或方法。指标可以分为绝对数指标和相对数指标，绝对数指标反映的是规模大小的指标，如人口数、GDP、收入、用户数，而相对数指标主要用来反映质量好坏的指标，如利润率、留存率、覆盖率等。 第一关键指标，OMTM（One Metric That Matters，第一关键指标），就是一个在当前阶段高于一切、需要你集中全部注意力的数字。 什么是好的数据指标 好的数据指标是比较性的。如果能比较某数据指标在不同的时间段、用户群体、竞争产品之间的表现，你可以更好地洞察产品的实际走向。“本周的用户转化率比上周高”显然比“转化率为 2%”更有意义。&amp;#x20; 好的数据指标是简单易懂的。如果人们不能很容易地记住或讨论某指标，那么通过改变它来改变公司的作为会十分困难。 好的数据指标是一个比率。会计和金融分析师仅需迅速查看几个比率就能对一个公司的基本状况做出判断。 如何找出正确的数据指标 定性指标与量化指标 。定性指标是经验性的 。量化指标涉及统计数据，可提供可靠的量化结果 虚荣指标与可付诸行动的指标 。如果你有一个数据，却不知如何根据它采取行动，该数据就仅仅是一个虚荣指标 。八个要避免的虚荣指标 1点击量 2页面浏览量（PV） 3访问量 4独立访客数（UV 只能显示有多少人访问了网页，却不能告诉你这些人在页面上做了什么？他们为什么停留？是否离开了？ ） 5粉丝/好友/赞的数量 6网站停留时间 7收集到的用户邮件地址量 8下载量 。对于虚荣数据指标，比如独立访客数的统计，只能显示有多少人访问了网页，却不能告诉你这些人在页面上做了什么？他们为什么停留？是否离开了？ 探索性指标与报告性指标 。探索性指标是推测性的 。报告性指标是陈述性的报告日常数据信息 先见性指标与后见性指标 。先见性指标用于预言未来 。后见性指标则用于解释过去 相关性指标与因果性指标 。如果两个指标总是一同变化，则说明它们是相关的 。如果其中一个指标可以导致另一个指标的变化，则它们之间具有因果关系 分析师特别关心那些能推动公司业绩增长的指标，即关键绩效指标（KPI）。每个行业都有自己的关键绩效指标：如果你是餐馆老板，该指标是每晚用掉的桌布量（翻台量）；如果你是投资者，该指标是你的投资回报率；如果你运营媒体网站，该指标是广告的点击率； 测试市场细分： 把一群拥有某种共同特征的人进行分类. 同期群分析： 按时间维度对用户建立分组，观察分组用户的行为特征表现。 A&#x2F;B 测试：同一时间段对不同被试群体提供不同的体验。A&#x2F;B 测试看似简单易行，实则有一个软肋。只有用户流量巨大的大型网站（如微软必应、谷歌）能对单一的因素（如链接颜色、网页速度）进行测试并迅速得到答案。如果没有庞大的用户流量，你将需要测试很多因素。这可能包括网页的色调，触发用户行为的链接文字，图片效果等。进行一连串的单独测试会延长你走向成熟的周期。与其如此，不如采用多变量分析法同时对多个属性进行测试，其原理为，用统计学方法剥离出单个影响因子与结果中某一项指标提升的相关性。 数据分析框架 戴夫·麦克卢尔的海盗指标说麦克卢尔将创业公司最需要关注的指标分为五大类：获取用户（Acquisition）提高活跃度（Activation）提高留存率（Retention）获取营收（Revenue）自传播（Referral）以上简称 AARRR。 埃里克·莱斯的增长引擎说 。黏着式增长引擎（黏着式增长引擎的重点是让用户成为回头客，并且持续使用你的产品，它和戴夫·麦克卢尔的提高留存率阶段这个概念类似） 。病毒式增长引擎 。付费式增长引擎 长漏斗框架一种分析方法，能够帮你理解你最初是如何获得客户的注意力的，以及客户从最初得知该网站到发生你所期望的行为（例如完成一次购物、生产一些内容、分享一段信息）的全过程。 最后花了几天看完了这本书，其中商业模式这一部分我没有整理，对于SAAS我后面会进一步介绍。书中有这么一句话： 市场上有太多的消费者了，而且他们的决策方式是非理性的，所以你可以操纵他们的感情。毫无疑问，云计算和社会化媒体使得我们不需要很多前期投入就可以推出并宣传产品 目前当我们浏览网页、购物等时自己的数据已经被收集（用户数据、行为数据、）可参考文章： 掌握数据生命周期：用户行为数据的4个来源 | 人人都是产品经理 (woshipm.com) 其中重要的是行为数据： who即唯一标识用户，在移动端，我们可以很方便地采集到user_id，一旦用户注册，就会生成新的user_id。（为了更好地统一和识别唯一用户，移动端还会采集device_id，通过手机设备自带的唯一标识码进行区分）when依旧是行为发生的时间。where即行为发生的地点，手机上，通过GPS定位权限，获取用户比IP更详细的经纬度数据并不难。what是具体的行为，浏览、点赞、评论、分享、关注、下单、举报、打赏，均是行为，如何统计取决于分析的维度。 现在流行一句话：大数据比你自己更了解你自己。我们的数据被采集后建立用户画像进行个性化推荐。 参考https://zhuanlan.zhihu.com/p/54843812内容： 比如我们建立用户画像之后，计算出来甲购买课程的意愿是 40%，乙购买课程的意愿是 90%。为了进一步提高购买量，我们会对购买意愿在 40% 的用户（甲）发放优惠券。如果没有建立这样一个用户画像标签，我们就会对甲和乙发放同样的优惠券。而乙类用户原本是不需要用优惠券进行激励的，这么一发，便会增加很多成本。这也就是电商利用用户画像标签实现的大数据杀熟。 甚至不管我们决策方式是否理性，我们都在被数据影响着。","categories":[],"tags":[{"name":"数据","slug":"数据","permalink":"http://hi-nikola.cn/tags/%E6%95%B0%E6%8D%AE/"}]},{"title":"汪曾祺和沙家浜","slug":"汪曾祺和沙家浜","date":"2022-07-09T03:02:34.000Z","updated":"2023-12-08T08:26:13.818Z","comments":true,"path":"2022/07/09/汪曾祺和沙家浜/","link":"","permalink":"http://hi-nikola.cn/2022/07/09/%E6%B1%AA%E6%9B%BE%E7%A5%BA%E5%92%8C%E6%B2%99%E5%AE%B6%E6%B5%9C/","excerpt":"想当初老子的队伍才开张，拢共才有十几个人、七八条枪。 遇皇军追得我晕头转向，多亏了阿庆嫂，她叫我水缸里面把身藏。","text":"想当初老子的队伍才开张，拢共才有十几个人、七八条枪。 遇皇军追得我晕头转向，多亏了阿庆嫂，她叫我水缸里面把身藏。 关于沙家浜昨日看《老头儿汪曾祺》才知道汪老居然是《沙家浜》的编剧，忍不住回温了数遍，我觉得配合视频来听更有感觉，像我这种对京剧不熟悉的人，里面的有些词语唱的太快我反应不过来，跟着字幕，看着演员的神情动作更能体会其中的妙处。 最开始是从电视剧《人民的名义》知道的智斗，有一集祁同伟、高小琴等人在酒桌上唱起来，瞬间觉得剧情局势紧张了起来，后去网易云搜了一下智斗，反复听了几遍觉得电视剧中用这一段京剧还是很用心的。 昨日在书中看到江青指派北京戏剧团改编沪剧剧本《芦苇火种》，创作班子里有薛恩厚、肖甲、杨毓珉、汪曾祺，后来剧本名改为了《沙家浜》，因为领导觉得《芦苇火种》字面意思矛盾，芦苇周围都是水，怎么能保存火种呢？后来改名成了《沙家浜》。 最开始听智斗中有这么一段听起来很是带劲： 垒起七星灶，铜壶煮三江。摆开八仙桌，招待十六方。来的都是客，全凭嘴一张。相逢开口笑，过后不思量。人一走，茶就凉……有什么周详不周详！ 看到书中才知道，这一段西皮流水在传统京剧里很少见，一般是七字一句，但是汪曾祺却用了五言来烘托气氛，当时负责唱腔设计的老师觉得五言不好安腔，汪备了一份七言的唱词，好在最终还是设计出五言的来了。这段唱词的核心是“人一走，茶就凉”，原来剧本里是没有这一句，后来这句话广为流传。 一次周总理在布置工作时最后加了一句，咱们可不要“人一走茶就凉呀”。一个人一辈子写的东西，有几句能够传下去，确实也值得高兴。 关于西皮流水，B站有个视频做得很有趣，在这里分享一下：西皮流水《哆啦A梦》 哔哩哔哩 碎碎念在写这篇博客之前，觉得自己有好多内容要写的，真的下笔了却不知该说些什么，草草了事。我写这篇博客目的就是表达一下自己知道了沙家浜居然是汪曾祺作品的一种兴奋激动的心情，其次也分享一下智斗- 网易云音乐 这部非常优秀的京剧现代戏，样板戏并不是‘死板戏’，江青搞戏剧这一行还是专业的。 (2022&#x2F;7&#x2F;9 )最近新换了hexo主题，我对这一次的主题很满意，未来可能不会更换主题，这个主题或许会一直伴随着我的这个博客了，毕竟折腾主题是一件新奇有趣但没有意义的事情，我还是想把重心放在阅读、思考、分享上。","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://hi-nikola.cn/tags/%E9%9A%8F%E7%AC%94/"}]},{"title":"读点汪曾祺","slug":"读点汪曾祺","date":"2022-06-17T14:27:18.000Z","updated":"2023-12-08T08:26:13.830Z","comments":true,"path":"2022/06/17/读点汪曾祺/","link":"","permalink":"http://hi-nikola.cn/2022/06/17/%E8%AF%BB%E7%82%B9%E6%B1%AA%E6%9B%BE%E7%A5%BA/","excerpt":"团长掏出枪来，从后面，一枪就把他打下来了。“我的女人，怎么能让他摸来摸去！她身上。除了我，任何男人都不许碰！这小子，太欺负人了！日他奶奶！”团长觉得怪委屈。","text":"团长掏出枪来，从后面，一枪就把他打下来了。“我的女人，怎么能让他摸来摸去！她身上。除了我，任何男人都不许碰！这小子，太欺负人了！日他奶奶！”团长觉得怪委屈。 这篇小说就这样戛然而止，故事的主人公就这么被团长一枪打死，死的不明不白。汪曾祺的小说大都是这样，从村里的张三、李四、王五的聊起，张三是开裁缝店的，李四是开炮仗店的，王五是画画的，他们怎么经营自己的生意，发生了哪些事儿。没有起承转合，没有一波三折，故事平淡的开始又平淡的结束，却总是让人回味无穷，就像一些小馆的调料总是盖过食物本身的味道，乍一品尝味道浓厚，一下子就能吸引味觉，但多吃几次就觉得千篇一律甚至让人齁得慌。 上学的时候作文课上老师就爱教这种写文章的方法，一定要下猛料才能吸引阅卷老师的注意力，最好标题就来一个“UC震惊体”，段首肯定要来两句名人名言：夏朔德说过这是最好的时代，约翰克里斯说过我们必将走向光明，周森人说黑夜给了我黑色的眼睛，以致我夜夜碰壁。段尾再点题，肯定也要引用著名诗人沃乱遍得的一句话：林子有两条路我选择了行人稀少的那一条，它改变了我的一生。 学生时代，我深信这种方法，因为每次这种格式的套路总能让我在考试中获得高分，以至于我相信这种格式的文章是标准的好文章，每当我的作文作为范文被老师在班上朗读时，我无比的荣耀。回想学生时代种种，这件事让我深深汗颜，甚至后悔：我当初要是能够按照自己的想法天马行空该多好啊，最有想象力的年纪却被套上了一副枷锁，郑人学履最终忘却了自己该怎么走自己的路。当然，把自己文笔的乏味归结于少年时代的作文考试未免有在掩盖自己思想的匮乏之嫌疑，但是这段经历也给我现在阅读“品味”积攒了几点教训： 不看书店门口的畅销书、成功学、心灵鸡汤 不看自媒体推荐人生必读，罗*浩、烦灯读书等更应该避而远之 不看名著导读，以及“从西游记学到的官场知识”“胡雪岩从商之道”知识等 少看哲学书，不看人生哲理的小故事 少看心理学书，尤其是中国人写的 为什么我说不看就不必看呢？当然，你想看也行。这是我的博客，我写的博文，自然是我的观点。 至于写作，更应该随心所欲，能够清楚表达就行，不必追求语言多么华丽，立意多么高远，最重要的是切勿拙劣的模仿，写自己想写的话，不必顾忌太多，这也是我写博客的原因之一，因为博客其实是反流量，反推荐机制的，真正吸引来看博客的我想大概是”一类人“吧，因此不必顾忌太多，毕竟不是为了流量，没人愿意在自己的日记里编写谎言，反正我是不愿意的，之前网络上调侃”正经人谁写日记？“看到这类评论总是头疼，我是不大愿意相信一个人每日坚持日记就是为了给自己树立人设的，况且我们普通人就更没必要了。”正经人写日记怎么呢？“就是”好玩“而已！ 上面说了这么多，和汪曾祺有很么关系呢？还是有点关系的，汪老的书，让我读得下去，读的有趣。我觉得读起来有趣的书很重要！举个例子：一个人忙碌了一整天，下班回到家，属实是不想再动弹，这个时候拿起汪老的书，是能够深入故事里的。那为什么不拿起抖音刷一会呢？当然是觉得抖音太无聊了，一个无聊的短视频接着另一个无聊的短视频，企图在短短几秒内抓住人的注意力，不就如同我上述提到的小馆菜品里重重的调味料吗？一个对生活失去兴趣的人是可怕的，日常的吃喝住行穿都是值得研究的，汪老喜欢看的书也足见他的兴趣所在：《东京梦华录》、《植物名实图考》、《容斋随笔》等。 不早了 睡觉去了 明天接着写 早上好，睡饱了，继续开始。 对于如何写小说，作者在《小说笔谈》中是这样谈及的： 语言的唯一标准，是准确。 在校尉营一派出所外宣传夏令卫生的墙报上看到一句话：“残菜剩饭必须回锅见开再吃”，我觉得这也是很好的语言。语言的目的是使人一看就明白，一听就记住。语言的唯一标准，是准确。 小说的结构的特点，是：随便。 戏剧的结构像建筑，小说的结构像树。戏剧的结构是比较外在的、理智的。写戏总要有介绍人物，矛盾冲突、高潮，多少是强迫读者(观众)接受这些东西的。戏剧是愚弄。小说的结构是更内在的，更自然的。一棵树是不会事先想到怎样长一个枝子，一片叶子，再长的。它就是这样长出来了。然而这一个枝子，这一片叶子，这样长，又都是有道理的。从来没有两个树枝、两片树叶是长在一个空间的。 在叙事中抒情，用抒情的笔触叙事，少发议论 现在的年轻人写小说是有点爱发议论。夹叙夹议，或者离开故事单独抒情。这种议论和抒情有时是可有可无的。在叙事中抒情，用抒情的笔触叙事。怎样表现倾向性? 中国的古话说得好：字里行间。 唯悠闲才能精细，不要着急。 写小说就是要把一件平平淡淡的事说得很有情致(世界上哪有许多惊心动魄的事呢)。同样一件事，一个人可以说得娓娓动听，使人如同身临其境；另一个人也许说得索然无味。要把一件事说得有滋有味，得要慢慢地说，不能着急，这样才能体察人情物理，审词定气，从而提神醒脑，引人入胜。急于要告诉人一件什么事，还想告诉人这件事当中包含的道理，面红耳赤，是不会使人留下印象的。 很喜欢《受戒》里描写明子和英子的片段，读起来总觉得明子在英子明前总是憨憨的，而英子总让人觉得清澈、天真，纯洁，就像夏日雨后的天空和湖面一样。这样的女孩子我最近只在汪曾祺的文字中这么强烈的感受到，我不知道怎么去形容这样的女孩，前面用到的“清澈、天真，纯洁”我总觉得描述的不准确总还缺少些什么，于是乎我就用“灵性”二字来概括吧。这个词我也是用来形容茶红的，在茶红身上我总是能感受到质朴而又热烈的情感，就像小英子那样。前几日有位博友留言评论茶红的文章： 小子：噢，我的天啊，看这个人，内心是如此的细腻，文笔如此的文艺，通篇都满含着青少年才有的那种对美朦胧羞涩的向往，天啊，这太人嫉妒了 非常感谢这位博友能够常来我的博客看看，毕竟这个博客可能就是我的一片世外桃源，基本没有告诉过什么人，我只是想在这里随意的记下自己想记录的东西，不受约束，无拘无束。当时把这条留言，转发给了茶红，茶红高兴地要跳起来，还特别嘚瑟的和我说：“我的美学可是走的是李泽厚朱光潜一路，压根就不是你想的白落梅安意如之流”，我哈哈大笑忙说“是的，是的，我怎么会把你和白落梅相提并论呢？”说到这里不会有白落梅的粉丝来喷吧？我先加一个狗头表情包，表示为我们两人的调侃。我摘录了《受戒》里的片段，真的是写的太好了，忍不住想分享给未曾看过这篇小说的人。 这是明子和英子初见的场景，是不是就觉得明子腼腆害羞，英子主动热情呢？ 到了一个河边，有一只船在等着他们。船上有一个五十来岁的瘦长瘦长的大伯，船头蹲着一个跟名字差不多的女孩子，在剥一个莲蓬吃。明子听到有人跟他说话，是那个女孩子。“是你要到荸荠庵当和尚吗？”明子点点头。“当和尚要烧戒疤哦！你不怕？”明子不知道怎么回答，就含含糊糊地摇头。……小英子把剩下的半个莲蓬扔给明海，小明子就剥开莲蓬壳，一颗一颗吃起来。大伯一桨一桨地划着，只听见船桨拨水的声音：“哗——许！哗——许！” 作者描述英子俩姐妹的长相的片段也极为有意思。我第一次在文章里看到形容人好看是浑身上下，头是头，脚是脚的，因为在我们村里这是一句调侃的话，当形容一个毫无特色的女孩子时只能应付几句：“那看那个女孩儿，多好啊！头是头，脚是脚。” 因此读到这里时总觉得好笑。 两个女儿，长得跟她娘像一个模子里托出来的。眼睛长得尤其像，白眼珠鸭蛋青，黑眼珠棋子黑，定神时如清水，闪动时像星星。浑身上下，头是头，脚是脚。头发滑滴滴的，衣服格挣挣的。大姐说：“你一天到晚咭咭呱呱——”“像个喜鹊！”“你自己说的！——吵得人心烦！”“心乱？”“心乱！”“你心乱怪我呀？”小英子话里有话，大英子已经有人家了。 这一段一起干活的场景，把明子对英子的暗恋写的美好。 荸荠藏在烂泥里。赤了脚，在凉浸浸滑溜溜的泥里踩着，——哎，一个硬疙瘩！伸手下去，一个红紫红紫的荸荠。她自己爱干这生活，还拉了明子一起去。她老是故意用自己的光脚去踩明子的脚。她挎着一篮子荸荠回去了，在柔软的田埂上留了一串脚印。明海看着她的脚印，傻了。五个小小的趾头，脚掌平平的，脚跟细细的，脚弓部分缺了一块。明海身上有一种从来没有过的感觉，他觉得心里痒痒的。这一串美丽的脚印把小和尚的心搞乱了。 结尾部分简直就是绝了！短短几句对话，英子和明子的感情跃然纸上。 小英子忽然把桨放下，走到船尾，趴在明子的耳朵旁边，小声地说：“我给你当老婆，你要不要？”明子眼睛鼓得大大的。“你说话呀！”明子说：“嗯。”“什么叫‘嗯’呀！要不要，要不要？”明子大声地说：“要！”“你喊什么！”明子小声说：“要——！” 我还把最后一段专门朗读给了茶红听，茶红没看过这篇小说，我觉得她和英子极其相似，由内而外，茶红也是白眼珠鸭蛋青，黑眼珠棋子黑，茶红说起话来也是连绵不绝像个喜鹊！不知道到时候她看完这篇小说后会不会认同我的观点呢？ 暂时分享到这里吧，主要是大早上起来就开始敲字，里面的文章都是我一个字敲的，后来发现利用搜狗输入法可以扫描小说文字，但是我还是想自己一个字一个字敲进去。饿了，要去吃饭了，等后面还要多看几本汪曾祺的书，多写几篇他的文章，到时候再来个读点汪曾祺2.0 3.0？哈哈，到时候再看吧。","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://hi-nikola.cn/tags/%E9%9A%8F%E7%AC%94/"}]},{"title":"记夏日摄影小事","slug":"记夏日摄影小事","date":"2022-05-30T12:56:23.000Z","updated":"2023-12-08T08:26:13.822Z","comments":true,"path":"2022/05/30/记夏日摄影小事/","link":"","permalink":"http://hi-nikola.cn/2022/05/30/%E8%AE%B0%E5%A4%8F%E6%97%A5%E6%91%84%E5%BD%B1%E5%B0%8F%E4%BA%8B/","excerpt":"我是很讨厌晒太阳的，我总觉得能从那些日光融融里，观照出自己的满身沉疴。但有一些美好的事情，可以把我推搡着挤进春天，例如说草的呼吸，花的盛放。还有读诗，写作，吃面包。今天写一些关于花事。","text":"我是很讨厌晒太阳的，我总觉得能从那些日光融融里，观照出自己的满身沉疴。但有一些美好的事情，可以把我推搡着挤进春天，例如说草的呼吸，花的盛放。还有读诗，写作，吃面包。今天写一些关于花事。 （一） 常言道“好风凭借力，送我上青云”凌霄花却无需冯虚御风，她坚韧的自有风骨。喜热耐阴耐碱，一点都不娇气。花期长到可以见证一个学子从炎热高考到九月报到，多么恰好。尤记得当年入学时，学校一栋古老的高墙上满是凌霄，缠缠绵绵的攀爬在壁上，高不见顶，彼时正有少年豪情，常驻足观望，似乎在那里有我青云直上的志向与前途。转眼四年一过，宿舍门口这株矮矮的凌霄花也盛开了，似是祝福。 （二） 这个我一直误以为叫小雏菊，看一方见地，才知晓为“一年蓬”。我觉得这名字很贴切可爱，一年一次，如约而至的盛开。如果你摘下一朵，去揪一揪她的蕊，自会发现其中奥秘。 （三） 一种很好养的花，格桑花。我爱她的白，不是虚张声势的白，也无需我层层叠叠的打开。她就在那里，树立着，展现她的纤细与洁白。成片看是另一种风情。 （四） 我不认识的小野花。很久以前见过白色的。这是什么呢？ （五） 计划要去拍木槿花，还记得木槿花一直被称颂的“颜如舜华”之美。但是我唐突了她的花期，这个美人吝啬又害羞，连个花骨朵都没羞于赠我。这是意外之喜。湖边的鸢尾花，开着我特别喜欢的粉橙色，多么的可爱。相比端庄大方的紫色，热情奔放的橙色，她娇怯清雅。像是杜牧笔下的“娉娉袅袅十三余 豆蔻梢头二月初”，一个招人喜爱的女孩。 （六） 这是什么花呀？一种小野花，对比了阿拉伯婆婆纳，附地菜都不像。我在一片一片的浓绿中找到了她，她很胆小，藏在深处，又想要在五月尽情的品尝太阳的味道。所以我发现了她。 ! 结语 我今天还拍到了广玉兰，月季，蒲公英，夹竹桃，黄鹌菜。但是校园里面的草地像是精心挑选出来的，少时很多常见的野花都没有发现。也可能是她们太羞涩了，在一方小小的自然里悄悄盛开。无论我是否到来，都不会阻挡她们应着时节肆意的从出生到凋零。在某个瞬间，我不可阻挡的喜欢上了这样的世界，自然万物，一岁一枯荣。我也喜欢看花呼吸的模样，我们要舒展骨骼，大口呼吸。不要藏匿于黑暗，而辜负了日光。 本文由茶红小豆投稿！茶红小豆 即博主女友，为了今天的配图，茶红身陷“虫林”拍摄，要知道茶红平日可最怕虫子了。","categories":[{"name":"茶红小豆","slug":"茶红小豆","permalink":"http://hi-nikola.cn/categories/%E8%8C%B6%E7%BA%A2%E5%B0%8F%E8%B1%86/"}],"tags":[{"name":"茶红","slug":"茶红","permalink":"http://hi-nikola.cn/tags/%E8%8C%B6%E7%BA%A2/"}]},{"title":"当我在跑步时，我在想什么-1","slug":"当我在跑步的时候，我在想什么","date":"2022-05-28T05:57:51.000Z","updated":"2023-12-08T08:26:13.708Z","comments":true,"path":"2022/05/28/当我在跑步的时候，我在想什么/","link":"","permalink":"http://hi-nikola.cn/2022/05/28/%E5%BD%93%E6%88%91%E5%9C%A8%E8%B7%91%E6%AD%A5%E7%9A%84%E6%97%B6%E5%80%99%EF%BC%8C%E6%88%91%E5%9C%A8%E6%83%B3%E4%BB%80%E4%B9%88/","excerpt":"跑就行了，像阿甘那样，要是哪一天累了，就停下来休息一下。","text":"跑就行了，像阿甘那样，要是哪一天累了，就停下来休息一下。 5月9日 0.5公里。哇，好累呀，感觉喘不过气来了，得放慢速度。1.2公里。 好想歇一会儿啊，怎么这么累，真想躺着，怎么突然想耍手机了，哎，不行啊，我怎么手机瘾这么大了，跑个步都想着刷手机。刷手机也没意思啊，以后多抽点时间锻炼吧。1.8公里 突然就有精力了，加速。2.8公里 加油再跑0.2公里就超过前一名了。3.0公里 最后两百米冲刺 速度快了反而没那么累。3.2公里 终于跑完了 好多汗啊。运动这件事真的要坚持呀，要不然身体一下子就下去了。 5月11日 开始速度放到6㎞&#x2F;h觉得不累，放到8km&#x2F;h，跑了1.2公里的时候，心脏有点疼，放缓速度，走了0.2公里，加快速度，变换速度从8㎞&#x2F;h到10㎞&#x2F;h到12㎞&#x2F;h又回到8㎞&#x2F;h，今天跑步状态很好，继续加油。 5月17日 开始前1.7公里都还好，超过了第二十名，速度放慢了以后一下子就感觉特别累，腿变得很沉重，中间走了一段距离才慢慢恢复过来，继续跑到3公里，准备结束了的时候，结果旁边有人看了我一眼，然后加快了速度，我总觉得他似乎好像要和我比赛，我这该死的好胜心，立刻也加快了速度，最后跑了4.2公里，那个人比我先减速，估计体力不支了，看来没我厉害呀。我感觉越跑越精神，主要是汗太多了，眼镜不停地往下滑，经常要用手推一下眼镜。 5月23日 1公里，今天膝盖疼，四天没跑步，感觉不习惯了。 5月24日 今天跑步3.6公里。刚跑到1.1公里的时候心脏疼，放慢速度，走了三四百米，恢复正常，基本上全程8km&#x2F;h，今天状态不错，刚好跑步机的位置正对着纱窗，可以看到外面街道上来来往往的行人，时不时还有一阵风吹过来，感觉真不错，看来我体力慢慢恢复了，等下次早上早点起来到东湖绿道跑一跑，肯定很舒服，还没见过早上七点的东湖绿道，人应该不多吧，刚好可以放开了跑。 5月27日 今天跑了2.2km。跑了两百米的时候，腿抽筋，慢慢恢复。今天不想跑了，太晚了，十一点了，明天休息，早点来专门有氧吧。顺便称了体重165.8斤，虽然没瘦，但是体力恢复了好多，先坚持跑个一个月吧，饮食上再注意一下。 5月28日 今天跑了5.20km。上午总体感觉还是很轻松的。刚开始跑了两公里，然后口干舌燥，放慢速度喝口水，休息休息，听到乐刻店长在和清洁阿姨讨论工资，估计这个阿姨是刚来的，好像每天只用工作三个小时，阿姨每天想要60块钱的工资，但是店长说只能给50块，然后挑刺说底板没擦干净，做事太慢了，三个小时的活其实两个小时就可以干完之类的话，哎，两个人为了每天十几块钱讲价，真不容易。 放快速度，超过了上一名，一下子充满了力量，跑到四公里休息了一下，继续一口气跑了一公里多，完成今天五公里的目标，全身都是汗，流个不停。休息之余赶紧记下跑步的想法，怕自己忘记了。 然后想到可以把每天的跑步的记录每个月汇总一下，发布到博客上面，也算是一种记录吧，其实想一想，健身这个事情究竟需要多大的决心呢？不就是单纯的因为想要运动，想跑步，然后跑了一次之后感觉不错，就一直保持下去了吗？真搞不懂网上那些人，跑个步都还要多大决心，才能够坚持的想法，可能成功学看多了，被毒害得不浅吧。 跑就行了，像阿甘那样，要是哪一天累了，就停下来休息一下。","categories":[],"tags":[{"name":"跑步","slug":"跑步","permalink":"http://hi-nikola.cn/tags/%E8%B7%91%E6%AD%A5/"}]},{"title":"电力交易基础知识","slug":"电力交易基础知识","date":"2022-05-27T15:49:27.000Z","updated":"2023-12-08T08:26:13.818Z","comments":true,"path":"2022/05/27/电力交易基础知识/","link":"","permalink":"http://hi-nikola.cn/2022/05/27/%E7%94%B5%E5%8A%9B%E4%BA%A4%E6%98%93%E5%9F%BA%E7%A1%80%E7%9F%A5%E8%AF%86/","excerpt":"在电改前，大部分用户都是从国家电网买电，支付的是目录电价。2016年电改后，允许电力用户直接与发电厂购电，或者通过售电公司统一代买的形式。电量变成商品，可以在电力交易中心这个市场进行交易。","text":"在电改前，大部分用户都是从国家电网买电，支付的是目录电价。2016年电改后，允许电力用户直接与发电厂购电，或者通过售电公司统一代买的形式。电量变成商品，可以在电力交易中心这个市场进行交易。 商品电能量、发电容量、电力辅助服务和输电权等商品 商品分类中长期交易市场主体开展的多年、年、季、月、周、多日等电力批发交易。 现货现货交易主要开展日前、日内、实时的电能量交易。 市场批发市场卖方就是发电企业，买方是售电企业、电力大用户 零售市场卖方是售电商，买方则是中小型终端用户 交易方式双边协商 集中竞价 挂牌交易 在电改前，大部分用户都是从国家电网买电，支付的是目录电价。2016年电改后，允许电力用户直接与发电厂购电，或者通过售电公司统一代买的形式。电量变成商品，可以在电力交易中心这个市场进行交易。 电力现货交易市场成员电力现货市场成员包括：市场主体、电网企业和市场运营机构三类。市场主体包括发电企业、售电公司（含独立售电公司和拥有配电网运营权的售电公司）、电力用户等；电网企业指国网电力有限公司；市场运营机构包括电力调度机构、电力交易机构。 电力交易中心包括地区电力交易中心和区域电力交易中心两类(北京电力交易中心和广州电力交易中心)电力交易中心主要负责市场交易平台的建设、运营和管理，提供结算依据和相关服务，也包括市场主体注册和相应管理，披露和发布市场信息等 业务资料参考 电力中长期交易基本规则 科普｜什么是电力市场交易，为何要搞电力现货交易？ 深度文章 | 南方（以广东起步）电力现货市场运行分析 山西电力中长期分时段交易机制的实践与分析 深度文章 | 南方（以广东起步）电力现货市场运行分析 持续更新学习ing","categories":[],"tags":[{"name":"电力","slug":"电力","permalink":"http://hi-nikola.cn/tags/%E7%94%B5%E5%8A%9B/"}]},{"title":"杂文一：从磨豆腐说起","slug":"我在古代做豆腐","date":"2022-05-17T08:28:01.000Z","updated":"2023-12-08T08:26:13.720Z","comments":true,"path":"2022/05/17/我在古代做豆腐/","link":"","permalink":"http://hi-nikola.cn/2022/05/17/%E6%88%91%E5%9C%A8%E5%8F%A4%E4%BB%A3%E5%81%9A%E8%B1%86%E8%85%90/","excerpt":"以前看小说的时候，我很喜欢幻想自己穿越了。并且和那种想要穿进有钱有势之家的想法不同——我就想穿越成为普通的百姓。还是那种住在深山里面的百姓，过田间种菜，山肴野蔌的生活。","text":"以前看小说的时候，我很喜欢幻想自己穿越了。并且和那种想要穿进有钱有势之家的想法不同——我就想穿越成为普通的百姓。还是那种住在深山里面的百姓，过田间种菜，山肴野蔌的生活。 沐浴汴京的月光，听树上的蝉鸣，直到分不清活在现在还是历史之中。即使医疗技术落后，即使封建不平等，那也不是我考虑的。为此，我想我需要具备一些发家致富的技能，例如说种田文必备的做豆腐、造肥皂等。 当我终于用脑子学会（是的，此时手还没有学会）怎么做豆腐以后，忽然想起来，古代人早就会做豆腐了，还有豆腐脑、豆花、豆干。豆制品非常之丰富。毕竟菽（大豆）在我国作为五谷之一，食用起源很早很早，被玩出花也不足为奇。尽管如此，也不能阻碍我对种田文的热情，种田文里面讲的多是田间的和餐桌上的事情。 一些很有智慧的古代人的事情。在细菌学和科学等还没有成立的年代，久久以前，我国的先辈就学会了酿酒、做毛豆腐、发酵酸奶、泡菜等等。泡菜在我国叫做“菹”，早在《周礼》里面就有记载，加盐的叫“咸菹”，少加盐多加酒曲麦饭的叫“淡菹”。做泡菜的先人还不知道细菌这个名词，却早已能熟练掌握发酵的程度。多么厉害！我喜欢这样的智慧。一如我对我们国家的喜欢、喜爱。我们国家有太多这样吸引我沉溺的历史、饮食、文化、艺术等等。 重回关于古代饮食。“脍炙人口”这个成语想来大家都不陌生，我们有很多由饮食文化引申出来的成语，再例如说“五味杂陈”。那么脍与炙分别代表什么烹饪方法呢，炙与燔有什么不同呢，五味是哪五味呢，辣椒没有传入中国前我们的祖先通过哪些食材增加辣的感觉呢。这些问题和正在吃饭的餐桌没有关系，我却喜欢去了解。 脍是生食，孔子有“食不厌，精脍不厌细”的说法。炙是穿在签子上烤，燔是加在火上面烤。五味是酸苦甘辛咸，辣味以前用某种果子替代，川地还有川椒提辣味。脍与炙的背后，还有我们先民复杂多样的烹饪方法。五味的背后，也有远不止五味的食物口感。我们的先民很擅长用火与土，从瓷器可以窥见一斑。在饮食上，也不例外。由火、土、水的多样组合，呈现出口感多样丰富的各种烹饪方法：煮、焖、炸、炒、煎、烤、脯…… 勤劳朴素的妇女可以用这些烹饪手法将简单的食材作出多种鲜美宜人的佳肴，可以在温饱的条件中创造新鲜与芳甘浓美（可以参照《吴氏中馈录》）。更不用说大厨、御厨了，唐有琼林盛宴、烧尾宴，清朝慈禧的饭桌上更是争奇斗艳，样式繁多。 但如果不是权贵之家，没有勤劳的双手，再恰逢荒年。白居易那句“是岁江南旱，衢州人食人”多么刺目。对比之下，我们生活在今天，早已不是荒年。我们有丰富便宜的食材，有成熟的烹饪方法，我们可以肆意的活在历史中享有历史的成果。当我吃一个软绵香醇的奶油蛋糕时，真想要古代某个豆蔻年华的小女孩也尝一尝这般美好。（或者现实生活中的小女孩，我也愿意送一块，小男孩也可以送，不性别歧视。要记得节约粮食哦！还有光盘行动~） 在开篇写豆腐时，不由想到小时候在小区门口吃的豆腐脑，一块五一碗免费加汤。北方咸口的豆腐脑很嫩，卤汁是胡辣汤的浓郁口感。味蕾还没有反应过来，脑海中早就有了清晰的口味，时隔十多年都难以忘怀。不仅仅张季鹰有莼鲈之思，迅哥儿有那夜似的好豆，我们每个人都有自己独特的味蕾记忆。 也希望以后，可以和Nikola一起创造更多我们的共同味蕾记忆。 想在中秋元宵的节日给他做月饼、汤圆，有很多想做的款式和馅料；想在二十四节气来临时给他做一做时令菜；想给他烤面包、让他感受我爱他一如面包柔软的心；想一起在周末休班的时候沐浴着阳光悠哉悠哉的醒来，商量着做一些可口平常的饭菜。（编者注：这段文字中的“他”指的就是博主本人！此文是博主女朋友投稿，居然在这里偷偷对我暗送秋波，深深感动了） 原来不用重回天水一朝，我也可以感受“种田般”惬意的生活。因为重点不是我在哪个时空朝代，而是我和谁在一起。 不需要找桃花源，四处尽是桃花源。 另附：对古代（宋朝）饮食文化感兴趣的话，推荐几本书：《宋宴》根据古方复刻的菜肴制法，不需要王刚的水平，居家也能复制。其中的梅花汤饼我很喜欢，给平淡的面食带来雅味。 《吴氏中馈录》一个古代小阿姨的私厨书，年代有争议。里面的食材做法很好复制，并且有不少新奇的时令菜做法，有兴趣的小伙伴可以看！ 《另类宋元》就是一边将历史一边讲于食物有一点点关系的，喜欢历史有时间的可以看看，想要种田的不推荐 《五味杂陈——中国传统饮食文化》大杂烩，很像是大学的校选书，好像就是的诶。有细节不太准，没有太深的内容，泛读型 《蔬菜史话》！！！超级推荐，从古代起源，各种蔬菜的发展演进和亲戚关系都讲的一清二楚！ 本文由茶红小豆投稿！ 茶红小豆 即博主女友，全网超1000余粉丝，多年深耕种田文，对吃（尤其是甜食）颇有独到见解。","categories":[{"name":"茶红小豆","slug":"茶红小豆","permalink":"http://hi-nikola.cn/categories/%E8%8C%B6%E7%BA%A2%E5%B0%8F%E8%B1%86/"}],"tags":[{"name":"茶红","slug":"茶红","permalink":"http://hi-nikola.cn/tags/%E8%8C%B6%E7%BA%A2/"}]},{"title":"武汉二手书店探寻","slug":"武汉二手书店","date":"2022-05-14T02:47:30.000Z","updated":"2023-12-08T08:26:13.789Z","comments":true,"path":"2022/05/14/武汉二手书店/","link":"","permalink":"http://hi-nikola.cn/2022/05/14/%E6%AD%A6%E6%B1%89%E4%BA%8C%E6%89%8B%E4%B9%A6%E5%BA%97/","excerpt":"逛二手书店是个很奇妙的感觉。一方面总会在不经意间以极其便宜的价格淘到一本“稀罕”的书，另一方面二手书中的种种痕迹隐藏着岁月的故事。","text":"逛二手书店是个很奇妙的感觉。一方面总会在不经意间以极其便宜的价格淘到一本“稀罕”的书，另一方面二手书中的种种痕迹隐藏着岁月的故事。 泉之旧书社 书店位于司门口附近，青龙巷里。书籍繁多，需要自己慢慢挑选，老板和老板娘很亲切友好。 红楼古旧书店 位于长春观对面。里面的书极多，种类繁多，可惜位置小了一点，很多书籍不方便拿取翻阅，需要老板帮忙。非常值得一去！ 武大附近又合书舍 位于八一路上。地方很小，书籍品相好，会用书壳包装，但是价格很高，老板对自己的书也如数家珍，那天看到汪真祺编的知味集，第一版的99新，欢喜的不得了，但是价格不太能接受，于是只淘了一本黄永玉的书，欣然离开。 集成古旧书社 武大附近，和又合书舍距离大概一两公里，书店很大，书籍很多，值得慢慢挑选，书店老板是一位老爷爷👨🏻‍🦳十分和蔼。 泰宁街 江汉路步行街附近，沿着南京路一直走就可看到，泰宁街不仅仅有二手书还有各种古玩器具相机磁带CD。","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://hi-nikola.cn/tags/%E9%9A%8F%E7%AC%94/"}]},{"title":"摄影项目-我的小侄女","slug":"摄影项目-我的小侄女","date":"2022-05-13T14:21:07.000Z","updated":"2023-12-08T08:26:13.724Z","comments":true,"path":"2022/05/13/摄影项目-我的小侄女/","link":"","permalink":"http://hi-nikola.cn/2022/05/13/%E6%91%84%E5%BD%B1%E9%A1%B9%E7%9B%AE-%E6%88%91%E7%9A%84%E5%B0%8F%E4%BE%84%E5%A5%B3/","excerpt":"这些照片是20年疫情刚结束，五月份的时候在家附近的公园拍的。拍小孩子说轻松也轻松，说累也累。","text":"这些照片是20年疫情刚结束，五月份的时候在家附近的公园拍的。拍小孩子说轻松也轻松，说累也累。 小孩子对着镜头不会紧张，会自然轻松地展现自己的状态（因此，拍小朋友更多的要采取抓拍，而不是让小孩子摆各种僵硬的动作）我觉得能够抓拍到那份天真的状态，任务就算完成了！当然，拍照全程要靠妈妈哄着，用零食”骗着“才肯乖乖配合。","categories":[],"tags":[{"name":"摄影","slug":"摄影","permalink":"http://hi-nikola.cn/tags/%E6%91%84%E5%BD%B1/"}]},{"title":"聊一聊我对互联网的思考","slug":"聊一聊我最近一直在思考的问题：互联网和信息茧房","date":"2022-05-07T12:56:24.000Z","updated":"2023-12-08T08:26:13.819Z","comments":true,"path":"2022/05/07/聊一聊我最近一直在思考的问题：互联网和信息茧房/","link":"","permalink":"http://hi-nikola.cn/2022/05/07/%E8%81%8A%E4%B8%80%E8%81%8A%E6%88%91%E6%9C%80%E8%BF%91%E4%B8%80%E7%9B%B4%E5%9C%A8%E6%80%9D%E8%80%83%E7%9A%84%E9%97%AE%E9%A2%98%EF%BC%9A%E4%BA%92%E8%81%94%E7%BD%91%E5%92%8C%E4%BF%A1%E6%81%AF%E8%8C%A7%E6%88%BF/","excerpt":"今天兴趣来了，聊一聊互联网的发展，和我对短视频时代“问题”的一些想法。","text":"今天兴趣来了，聊一聊互联网的发展，和我对短视频时代“问题”的一些想法。 互联网的发展史这里不准备特别正式的讲它的发展阶段，全凭我的兴趣来吧。1994年，中国正式接入互联网。1997年，网易。1998年，搜狐、腾讯、新浪、（谷歌）。1999年，阿里巴巴。2000年，百度。 经常看到有人谈论web1.0 、web2.0 、web 3.0，其实通俗的讲： web1.0 “只读”状态，网站提供什么，用户就查看什么，几乎没有互动，这个时期的许多门户网站：搜狐、网易、新浪。web2.0 “互动“状态，用户可以在网络平台上传自己的内容，互联网从“平台向用户的单向传播”，变成了“用户与用户的双向互动”，像现在的抖音、豆瓣、知乎、推特。web3.0“交互”状态，智能机器广泛参与到网络过程中来。 对于web3.0 有观点也认为是用户创造、用户所有、用户控制，代表：区块链、元宇宙、DAO、NFT。 再聊一聊博客的发展，2002年，虽然是互联网的寒冬，但是也是中国的博客元年，那一年方兴东创办了博客中国。至于博客是怎么火起来的呢？我也是今天写文章的时候才知道：2004年的时候，有个叫木美子的女人带火了博客。话说刚刚好奇她的《遗情书》，到底是怎么样的内容当年能火成那样？去看了看原作，写的真不错，果然人类进步是靠性来推动的啊。 直到2004年木子美事件，才让中国民众了解到了博客，并运用博客。国内各门户网站，如新浪、搜狐加入博客阵营，2005年，腾讯也开通博客，也就是现在的QQ空间。 木子美是一名编辑、网络作家，广东人，成名大作是《遗情书》。2003年开始在网上公开自己的性爱日记，尤其是与某摇滚乐手的“一夜情”细节，而“一炮而红”，形成“木子美现象”引发网友热议。 目前的互联网现状从早期的BBS、博客到后来的SNS–QQ、贴吧、微博,到短视频 ，信息传递的形式一直在变化。 不知道大家是否清楚blog 、vlog、 plog三者，前几年欧阳娜娜带火了vlog，随后又玩起了plog. 目前大火的肯定是短视频了，抖音快手火了之后其他平台纷纷加入，现在的网易云音乐、微信、微博都有短视频的入口，或许对这些互联网大厂来讲，想赚钱就必须涉及社交平台、引入短视频。 我的小烦恼1.低质量的内容太多了 现在能够写博客的人都是少数了，为什么呢？因为现在火的是微博、短视频，为什么这些火了？因为微博、抖音具有传播优势，短而快的内容更易于人们接受。但是问题就来了，他们的内容容量也决定他们的内容趋向于生活化和娱乐化，无法涉及更深度的讨论，而博客不一样，博客的内容需要思想化，需要花费更多的时间来写作、思考、查阅资料。就比如这篇文章我以为我自己一个小时就可以搞定的，结果三个小时了才磕磕绊绊的写完，在写作的过程中遇到了一些知识盲区，我都需要是查验一下，再继续写作，这是我在发表微博或者短视频时基本不会遇到的。 那么问题就来了，我现在需要的不是短而快的内容，我需要的是有价值、经过思考的的内容，这些都是目前流行的平台没办法带给我的。每天打开微博都是明星绯闻，或者屁大点事（某某女性机场照、某某综艺又火了）、抖音都是一些标题党（震惊！经常熬夜的人……）,或者一些新奇但无聊的内容，当然了，也是有科普视频的，但是这些内容我随便找来一本相关书籍都比他详细具体。 2.算法推荐到底带给我什么？ 我也不知道算法推荐到底是从什么时候开始的，反正淘宝会推荐我曾经搜索过的类似的物品，头条会推荐一些我看过的新闻报道，抖音会推荐我看过的类似的短视频，离谱的是可能我在知乎刷过的某个音乐推荐歌单，在我打开网易云音乐时正好出现（举个例子而已，类似的事出现过多次）这些算法到底是服务了我的生活还是侵犯了我的隐私？到底需不需要这些推荐呢？我的回答是：当我知道自己想要什么的时候，请你不要推荐给我，并且我可以自主选择是否关闭推荐机制。想想看这样的场景：我偶尔一次在B站搜索过“脱发”，我并不需要治疗脱发，只是了解，然而在接下来的日子里抖音给我推荐“熬夜导致脱发”，淘宝给我推荐治疗脱发的药膏，头条刷出“震惊！一男子因吃xxx一夜之间，头发竟然长起来了”的新闻。脱发一下子成了块牛皮鲜怎么甩也甩不掉，原因只是因为我偶尔一次在B站搜索过“脱发”……商业把人的行为数据化进而通过这些手段来谋取他们最大的利益还美其名曰：为人民服务。 3.互联网越来越开放了吗？ 每天都在生产数据，互联网的内容越来越多，但是噪音却越来越大，而且互联网似乎在变得越来越封闭，打开网页看到一条有趣的视频却需要下载某某APP才能继续观看，天啊，到底是谁想出的这么让人难受的东西！通过搜索引擎并不容易搜索到所有平台的内容，看短视频要下载抖音，看公众号一定要通过微信端，资本家们都想获得流量的入口，或者说我这种“只通过一个平台就可以获得信息”的想法就是天真的，互联网会走向越来越封闭吗？ 4.热搜真的是热搜吗？ 经常看到微博热搜排行出现一些我根本不关心的内容，这个时候我就在想这个热点是在某个圈子里很火了吗？同样的知乎等也是一样的，这些上了热搜的新闻真的是这个时间段里绝大多数人关心的新闻吗？显然不是，可以得出这样一个结论，热搜不代表大多数人，这个结论是很有意思的，既然并不是绝大多数人关注，那么热搜的意义是什么呢？绝大多数人希望看到的新闻是否能上热搜呢？是哪些人在制造这些热搜呢？——热搜只不过是虚假的热闹而已。像我这等为了生活拼命奔波，累的都懒得打字对线的人基本不会在网络上发声，所以像我这样基本不在网络上发声的人到底有多少呢？ 5.互联网的戾气是不是越来越重了？ 不知道互联网是什么时候打响的“男权女权”第一枪，总感觉现在的互联网越来越多的谈论着更敏感的话题：人口结构、工资福利、贫富差距、性别……这些话题不停的在网上翻来覆去的出现，时刻可能引爆仅有的一丝平静。这些问题是事实吗？有解决办法吗？我们究竟是在发泄情绪还是企图解决问题？在论坛上我看到这样一个帖子知乎怎么了？里面有几点观点是可以思考的： 知乎的 F 轮融资，投资方正是百度和快手，百度也在此后不但不排挤知乎，反而给予更多流量扶持，用知乎流行的一个词来说就是——利益相关。 话题的二元对立可以引发争论带来流量。 通过诱导舆论，可以让少数人的言论被当成了大家的共识，而沉默的大多数人以为自己是少数。 决心做出改变之前看到某位博主说：远离中文社交媒体，它会给你带来不幸。既然目前大火的媒体、平台都没办法满足我，而且干扰我的生活、占用我的时间，我干脆统统抛弃！卸载了豆瓣、知乎、微博等 只在有需要的时候通过web查阅，我发现不看这些东西对我的生活一点影响都没有，不知道某某新闻、某某热点事件不会影响我的生活。相反，当我需要这些材料然后去刻意获取的时候我能更清楚理清楚脉络。 今天就写道这里吧，有机会再补充！写博客的的确确是需要时间和知识储备的~","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://hi-nikola.cn/tags/%E9%9A%8F%E7%AC%94/"}]},{"title":"我的百宝箱","slug":"我的工具箱","date":"2022-05-07T01:24:57.000Z","updated":"2023-12-08T08:26:13.721Z","comments":true,"path":"2022/05/07/我的工具箱/","link":"","permalink":"http://hi-nikola.cn/2022/05/07/%E6%88%91%E7%9A%84%E5%B7%A5%E5%85%B7%E7%AE%B1/","excerpt":"这里罗列我平时常用的一些提升效率的软件、常看的网站论坛、推荐的书籍","text":"这里罗列我平时常用的一些提升效率的软件、常看的网站论坛、推荐的书籍 一些工具 笔记软件：我来我来 wolai - 不仅仅是未来的云端协作平台与个人笔记 Markdown编辑器：typoratypora官方网站 picsew手机图片编辑APPApp Store 上的“Picsew - 滚动截图和长图拼接” (apple.com) snapseed手机修图APP手机上最强的修图 App——Snapseed - 知乎 (zhihu.com) 坚果云盘同步坚果云专业版 一些网站 CNU摄影网站 CNU视觉联盟官方网站 虫社区交流论坛快搜 - 搜索快人一步 - Google (chongbuluo.com)","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"http://hi-nikola.cn/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"摄影项目-结婚","slug":"摄影项目-结婚","date":"2022-05-07T01:02:13.000Z","updated":"2023-12-08T08:26:13.773Z","comments":true,"path":"2022/05/07/摄影项目-结婚/","link":"","permalink":"http://hi-nikola.cn/2022/05/07/%E6%91%84%E5%BD%B1%E9%A1%B9%E7%9B%AE-%E7%BB%93%E5%A9%9A/","excerpt":"2020年，姐姐结婚拍的一组照片，我做成了一本小画册，之前放在了我的微信公众号，现在把它搬到自己的博客来。","text":"2020年，姐姐结婚拍的一组照片，我做成了一本小画册，之前放在了我的微信公众号，现在把它搬到自己的博客来。","categories":[],"tags":[{"name":"摄影","slug":"摄影","permalink":"http://hi-nikola.cn/tags/%E6%91%84%E5%BD%B1/"}]},{"title":"谈谈我对摄影的一些思考","slug":"我和摄影","date":"2022-04-29T16:34:57.000Z","updated":"2023-12-08T08:26:13.709Z","comments":true,"path":"2022/04/30/我和摄影/","link":"","permalink":"http://hi-nikola.cn/2022/04/30/%E6%88%91%E5%92%8C%E6%91%84%E5%BD%B1/","excerpt":"我对摄影的思考，我对拍照的看法。 2020年疫情被封在家里几个月，实在无聊，就玩起了买了一年多的相机，首先是是对相机的了解，其次是对摄影技术的了解（光圈、快门、ISO、对焦等），然后是构图、光线，最后是审美的提升。现在发现，学习摄影最直接的方式是看说明书+看摄影作品，仅仅靠这两个就够了！网上各种摄影教学视频，质量参差不齐，建议选择性观看，如果你不知道怎么学习，网络上有很多摄影学习途径的总结，大家可以去查阅。这里我推荐一下原画册这个公众号，大家可以看看，我觉得质量是很高的。","text":"我对摄影的思考，我对拍照的看法。 2020年疫情被封在家里几个月，实在无聊，就玩起了买了一年多的相机，首先是是对相机的了解，其次是对摄影技术的了解（光圈、快门、ISO、对焦等），然后是构图、光线，最后是审美的提升。现在发现，学习摄影最直接的方式是看说明书+看摄影作品，仅仅靠这两个就够了！网上各种摄影教学视频，质量参差不齐，建议选择性观看，如果你不知道怎么学习，网络上有很多摄影学习途径的总结，大家可以去查阅。这里我推荐一下原画册这个公众号，大家可以看看，我觉得质量是很高的。 先说说学习摄影中应该注意的一些问题： 1.在观念上一定要摆正。什么意思呢？就是明确摄影的目的，究竟为什么学习摄影！如果不是为了商业（就是通过拍照赚钱），请记住：拍自己喜欢的就好，怎么开心怎么拍！最开始不要因为在意自己拍的不好看而不拍。很多人一开始不会拍照，不懂得基本的摄影技巧，乱按快门，看到自己拍的一塌糊涂的照片后很沮丧，觉得自己没有摄影的天赋。其实这个时候就需要摆正心态：人都是从不会到会，这是一个过程，一个阶段，首先要接纳这个阶段的自己，保持学习，了解摄影的知识，才能走出这个阶段。进而，又会有很多人会陷入技术的误区，琢磨着光圈、快门、构图、光影、色彩等，有的后来会发展成为器材党，这个时候难道不应该停下来反思一下：我究竟为什么而拍照吗？可能最开始就只是想给自己的家人、女朋友拍照或者简单记录一下自己生活，既然这样为何要陷入技术的泥潭里面呢？技术够用就行了，重点放在自己想拍的内容。 2.摄影应该把核心放在：记录和表达。对于大多数人，拍照的目的无非就是两种：记录和表达。拍拍自己今天的午餐、自己工作的环境，这些都是记录，这些记录很真实，可能照片并不“美”，但是却是自己实实在在拍出来的最真实的样子，这些照片经历时间的洗刷，比如十年后再看看这些照片，可能是不一样的感觉。所以，对于一些目前不是很满意的照片，不妨换个角度，想象自己要是十年后再看会产生什么样的心情呢？所以从这个角度出发，如果男朋友拍下自己的丑照，是不是就不会暴跳如雷呢？毕竟十年后再看自己的这些照片那些“丑照”可能远远比精心摆pose然后高P的照片要有意思的多。那什么是表达呢？（这里要说一下，表达和记录是不一样的，出发点不一样导致结果不同）表达是在某个主题、某个想法下拍出来的一张（组）照片，更多的是对记录的一种提炼，所以我建议（我对自己的要求）尽量的多拍，带着项目的思维去拍照，更多的通过一组照片来表达自己的想法，而不是一张照片（一张照片出彩会很难，而且也是需要有概率能够拍到这些画面的）。 3.对好的照片的理解。究竟什么是好的照片？可能比较经典的回答是纽约摄影中提出来的：主题明确、主体突出、画面简洁。我最开始学摄影的时候也是带着这三个要求去拍摄的，但是，真的是这样吗？来看看下面这几张照片： 以上这些照片大家觉得满足纽摄三要素吗？好像不太满足。但是是不是感觉拍的还可以？可能有读者觉得这些拍的都是什么鬼。这里就公布一下摄影师:川内伦子、史蒂芬肖尔。（这里有人又会说大佬拍的照片一定是好照片吗？大佬就不会拍烂片吗？本文目前不讨论这个问题，仅仅是希望能让各位读者朋友们换一个观看照片的角度）。不满足所谓的纽约摄影标准的照片不一定不是好照片，从知乎上大家也可以搜索到类似的问题：手机里自己最喜欢的照片是哪张？ - 知乎 ，里面很多有趣的照片，这些照片满足了三要素吗？但是我还是觉得还挺不错的。这里我想说的是，随着时代的发展对摄影的认识也在改变，大家不要用传统的纽摄三要素的标准来定义一张好的照片了，应该拓宽自己的审美光谱。 4.很多人很难同时看到天空和蓝色：对色彩的认识。在很早之前摄影一直是黑白主导的，彩色被认为是粗鄙的。但是随着时代的发展，思想在进步。然而现在很多人的思维仍然一直停留在“远古”时期。大家再来看看这几张照片： 这些照片似乎找不到主题，没有内容，没有讲述精彩的瞬间，但是，朋友们，请放下你脑袋里面的任何想法，just feel， Do not think！来看看这些照片，颜色是很美的对吧？颜色不仅仅是这些物体的属性也是他们本身啊！ 尝试把一些相似的颜色组合起来也很有意思，这里放一些我的照片，大家感受一下。 ! 所以，总结一下：去拓宽自己的审美认知。多去感受一张照片，而不仅仅是用各种标准来约束自己！ 来说说我喜欢的摄影师（比较有代表性的）：川内伦子埃里克·索斯威廉·艾格斯顿214 并且在这里我强烈建议，如果可以的话，去看看你喜欢的摄影师的个人摄影网站（经济条件允许，可以选择画册）。这里我推荐原画册的这篇公众号文章：为什么要看摄影师的个人网站？ 画册比较贵、展览不常有、网络信息杂，其实个人网站是个性价比很高的欣赏窗口。某种意义上来说，散见于互联网的作品是很难get到真正魅力的，在个人网站上，加持设计感、交互感和作品系统性，才能将摄影的魅力真正展现。图虫和500px等摄影门户网站，无论再独立，也终究是为流量和资本服务，所见推荐依然是投大众所好，底层逻辑依然以单张的视觉猎奇为主。而通过个人网站可以深入了解摄影师创作的脉络，看到他们的项目、成长过程，还有文字、视频材料予以辅助。同时，可以学习他们的个人品牌运营方式。 同时，也给出了推荐：水谷吉法、细仓真弓、井津建郞、杉本博司 等 而且我发现感受力是非常重要的，这个东西很虚但是就是实实在在存在，比如有的人他能发现更多的细节，对一些东西会有不同的感受，那么他拍出来的照片就会带给人不同的感受。如果你没有，那也没有关系！拍就完事了，毕竟摄影应该是一件让人开心的事情，即使没有天赋也不应该影响自己去享受这份快乐！","categories":[],"tags":[{"name":"摄影","slug":"摄影","permalink":"http://hi-nikola.cn/tags/%E6%91%84%E5%BD%B1/"}]},{"title":"hexo发布博客的流程","slug":"hexo发布博客的流程","date":"2022-04-29T08:01:28.000Z","updated":"2023-12-08T08:26:13.691Z","comments":true,"path":"2022/04/29/hexo发布博客的流程/","link":"","permalink":"http://hi-nikola.cn/2022/04/29/hexo%E5%8F%91%E5%B8%83%E5%8D%9A%E5%AE%A2%E7%9A%84%E6%B5%81%E7%A8%8B/","excerpt":"搭建好了hexo，就可以更新自己的文章了！","text":"搭建好了hexo，就可以更新自己的文章了！ 提升效率的两个工具： Typora 坚果云 更多工具可以到我的收藏查看：我的收藏 - Nikola的个人博客 话不多说，来看看hexo发布博客的流程的几个流程吧！ 创建文章在blog文件夹下打开 GIT GUI HERE hexo new &quot;文章名&quot; #新建md文件 写文章由于文章是md格式，我建议下载typora软件对Markdown进行编写会更方便。Typora支持实时预览，快捷键，以及图片拖拉上传十分方便 文章发布hexo clean hexo g #hexo s #预览 hexo d #上传 云备份由于文章是保存在本地的，其他的没了都无所谓，自己的文章万一被误删那就心疼死了。因此我建议用坚果云备份一下source中的文章。 参考：Hexo博客新建文章并发布 - 简书 (jianshu.com)","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"http://hi-nikola.cn/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"first test","slug":"newpapername","date":"2022-04-27T17:54:11.000Z","updated":"2023-12-08T08:26:13.696Z","comments":true,"path":"2022/04/28/newpapername/","link":"","permalink":"http://hi-nikola.cn/2022/04/28/newpapername/","excerpt":"","text":"尝试连接域名把之前阿里云买的域名用起来。成功！ 终于开始写了！试一试@-@ 2022-4-28 凌晨1：55","categories":[],"tags":[]}],"categories":[{"name":"English","slug":"English","permalink":"http://hi-nikola.cn/categories/English/"},{"name":"茶红小豆","slug":"茶红小豆","permalink":"http://hi-nikola.cn/categories/%E8%8C%B6%E7%BA%A2%E5%B0%8F%E8%B1%86/"}],"tags":[{"name":"思考","slug":"思考","permalink":"http://hi-nikola.cn/tags/%E6%80%9D%E8%80%83/"},{"name":"English","slug":"English","permalink":"http://hi-nikola.cn/tags/English/"},{"name":"生活","slug":"生活","permalink":"http://hi-nikola.cn/tags/%E7%94%9F%E6%B4%BB/"},{"name":"摄影","slug":"摄影","permalink":"http://hi-nikola.cn/tags/%E6%91%84%E5%BD%B1/"},{"name":"技术","slug":"技术","permalink":"http://hi-nikola.cn/tags/%E6%8A%80%E6%9C%AF/"},{"name":"求职","slug":"求职","permalink":"http://hi-nikola.cn/tags/%E6%B1%82%E8%81%8C/"},{"name":"新闻","slug":"新闻","permalink":"http://hi-nikola.cn/tags/%E6%96%B0%E9%97%BB/"},{"name":"随笔","slug":"随笔","permalink":"http://hi-nikola.cn/tags/%E9%9A%8F%E7%AC%94/"},{"name":"数据","slug":"数据","permalink":"http://hi-nikola.cn/tags/%E6%95%B0%E6%8D%AE/"},{"name":"茶红","slug":"茶红","permalink":"http://hi-nikola.cn/tags/%E8%8C%B6%E7%BA%A2/"},{"name":"跑步","slug":"跑步","permalink":"http://hi-nikola.cn/tags/%E8%B7%91%E6%AD%A5/"},{"name":"电力","slug":"电力","permalink":"http://hi-nikola.cn/tags/%E7%94%B5%E5%8A%9B/"}]}